
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>地址 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="../part-6/transactions-2.html" />
    
    
    <link rel="prev" href="../part-4/transactions-1.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    前言
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">Bitcoin</li>
        
        
    
        <li class="chapter " data-level="2.1" data-path="../part-1/basic-prototype.html">
            
                <a href="../part-1/basic-prototype.html">
            
                    
                    基本原型
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2" data-path="../part-2/proof-of-work.html">
            
                <a href="../part-2/proof-of-work.html">
            
                    
                    工作量证明
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.3" data-path="../part-3/persistence-and-cli.html">
            
                <a href="../part-3/persistence-and-cli.html">
            
                    
                    持久化和命令行接口
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.4" data-path="../part-4/transactions-1.html">
            
                <a href="../part-4/transactions-1.html">
            
                    
                    交易（1）
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="2.5" data-path="address.html">
            
                <a href="address.html">
            
                    
                    地址
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.6" data-path="../part-6/transactions-2.html">
            
                <a href="../part-6/transactions-2.html">
            
                    
                    交易（2）
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.7" data-path="../part-7/network.html">
            
                <a href="../part-7/network.html">
            
                    
                    网络
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">Ethereum</li>
        
        
    
        <li class="chapter " data-level="3.1" data-path="../ethereum/design-rationale.html">
            
                <a href="../ethereum/design-rationale.html">
            
                    
                    设计原理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.2" data-path="../ethereum/ethereum-sharding-overview-and-finality.html">
            
                <a href="../ethereum/ethereum-sharding-overview-and-finality.html">
            
                    
                    以太坊分片：overview and finality
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.3" data-path="../ethereum/ethereum-casper-101.html">
            
                <a href="../ethereum/ethereum-casper-101.html">
            
                    
                    以太坊 Casper 101
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.4" data-path="../ethereum/ethereum-casper-101-glossary.html">
            
                <a href="../ethereum/ethereum-casper-101-glossary.html">
            
                    
                    以太坊 Casper 101 词汇表
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">Cardano</li>
        
        
    
        <li class="chapter " data-level="4.1" data-path="../cardano/cardano-introduction.html">
            
                <a href="../cardano/cardano-introduction.html">
            
                    
                    卡尔达诺入门必备
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.2" data-path="../cardano/ouroboros.html">
            
                <a href="../cardano/ouroboros.html">
            
                    
                    ouroboros
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">Menero</li>
        
        
    
        <li class="chapter " data-level="5.1" data-path="../monero/what-is-monero.html">
            
                <a href="../monero/what-is-monero.html">
            
                    
                    什么是门罗币？终极入门指南
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">IOTA</li>
        
        
    
        <li class="chapter " data-level="6.1" data-path="../iota/iota_consensus_v1.0.html">
            
                <a href="../iota/iota_consensus_v1.0.html">
            
                    
                    IOTA 交易，确认和共识
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">Misc</li>
        
        
    
        <li class="chapter " data-level="7.1" data-path="../misc/blockchain-consensus.html">
            
                <a href="../misc/blockchain-consensus.html">
            
                    
                    区块链共识
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="7.2" data-path="../misc/the-blockchain-economy-a-beginners-guide-to-institutional-cryptoeconomics.html">
            
                <a href="../misc/the-blockchain-economy-a-beginners-guide-to-institutional-cryptoeconomics.html">
            
                    
                    区块链经济学：制度加密经济学入门指南
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="7.3" data-path="../fundamentals/explain-pow.html">
            
                <a href="../fundamentals/explain-pow.html">
            
                    
                    PoW 本质上是个去中心化的时钟
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="7.4" data-path="../misc/dpos-consensus-algorithm-this-missing-white-paper.html">
            
                <a href="../misc/dpos-consensus-algorithm-this-missing-white-paper.html">
            
                    
                    DPOS 共识算法 - 缺失的白皮书
            
                </a>
            

            
        </li>
    

    
        
        <li class="divider"></li>
        
        
    
        <li class="chapter " data-level="8.1" data-path="../acknowledgement.html">
            
                <a href="../acknowledgement.html">
            
                    
                    致谢
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >地址</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x5730;&#x5740;">&#x5730;&#x5740;</h1>
<h2 id="&#x5F15;&#x8A00;">&#x5F15;&#x8A00;</h2>
<p>&#x5728;&#x4E0A;&#x4E00;&#x7BC7;&#x6587;&#x7AE0;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x521D;&#x6B65;&#x5B9E;&#x73B0;&#x4E86;&#x4EA4;&#x6613;&#x3002;&#x76F8;&#x4FE1;&#x4F60;&#x5E94;&#x8BE5;&#x4E86;&#x89E3;&#x4E86;&#x4EA4;&#x6613;&#x4E2D;&#x7684;&#x4E00;&#x4E9B;&#x5929;&#x7136;&#x5C5E;&#x6027;&#xFF0C;&#x8FD9;&#x4E9B;&#x5C5E;&#x6027;&#x6CA1;&#x6709;&#x4E1D;&#x6BEB;&#x201C;&#x4E2A;&#x4EBA;&#x201D;&#x8272;&#x5F69;&#x7684;&#x5B58;&#x5728;&#xFF1A;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x4E2D;&#xFF0C;&#x6CA1;&#x6709;&#x7528;&#x6237;&#x8D26;&#x6237;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x4E5F;&#x4E0D;&#x4F1A;&#x5728;&#x4EFB;&#x4F55;&#x5730;&#x65B9;&#x5B58;&#x50A8;&#x4E2A;&#x4EBA;&#x6570;&#x636E;&#xFF08;&#x6BD4;&#x5982;&#x59D3;&#x540D;&#xFF0C;&#x62A4;&#x7167;&#x53F7;&#x7801;&#x6216;&#x8005; SSN&#xFF09;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x603B;&#x8981;&#x6709;&#x67D0;&#x79CD;&#x9014;&#x5F84;&#x8BC6;&#x522B;&#x51FA;&#x4F60;&#x662F;&#x4EA4;&#x6613;&#x8F93;&#x51FA;&#x7684;&#x6240;&#x6709;&#x8005;&#xFF08;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x4F60;&#x62E5;&#x6709;&#x5728;&#x8FD9;&#x4E9B;&#x8F93;&#x51FA;&#x4E0A;&#x9501;&#x5B9A;&#x7684;&#x5E01;&#xFF09;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#xFF08;address&#xFF09;&#x9700;&#x8981;&#x5B8C;&#x6210;&#x7684;&#x4F7F;&#x547D;&#x3002;&#x5728;&#x4E0A;&#x4E00;&#x7BC7;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x628A;&#x4E00;&#x4E2A;&#x7531;&#x7528;&#x6237;&#x5B9A;&#x4E49;&#x7684;&#x4EFB;&#x610F;&#x5B57;&#x7B26;&#x4E32;&#x5F53;&#x6210;&#x662F;&#x5730;&#x5740;&#xFF0C;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x5C06;&#x8981;&#x5B9E;&#x73B0;&#x4E00;&#x4E2A;&#x8DDF;&#x6BD4;&#x7279;&#x5E01;&#x4E00;&#x6837;&#x7684;&#x771F;&#x5B9E;&#x5730;&#x5740;&#x3002;</p>
<blockquote>
<p>&#x672C;&#x6587;&#x7684;&#x4EE3;&#x7801;&#x5B9E;&#x73B0;&#x53D8;&#x5316;&#x5F88;&#x5927;&#xFF0C;&#x8BF7;&#x70B9;&#x51FB; <a href="https://github.com/Jeiwan/blockchain_go/compare/part_4...part_5#files_bucket" target="_blank">&#x8FD9;&#x91CC;</a> &#x67E5;&#x770B;&#x6240;&#x6709;&#x7684;&#x4EE3;&#x7801;&#x66F4;&#x6539;&#x3002;</p>
</blockquote>
<h2 id="&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;">&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;</h2>
<p>&#x8FD9;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x771F;&#x5B9E;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#xFF1A;<a href="https://blockchain.info/address/1A1zP1eP5QGefi2DMPTfTL5SLmv7DivfNa" target="_blank">1A1zP1eP5QGefi2DMPTfTL5SLmv7DivfNa</a>&#x3002;&#x8FD9;&#x662F;&#x53F2;&#x4E0A;&#x7B2C;&#x4E00;&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#xFF0C;&#x636E;&#x8BF4;&#x5C5E;&#x4E8E;&#x4E2D;&#x672C;&#x806A;&#x3002;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x662F;&#x5B8C;&#x5168;&#x516C;&#x5F00;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x8981;&#x7ED9;&#x67D0;&#x4E2A;&#x4EBA;&#x53D1;&#x9001;&#x5E01;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x77E5;&#x9053;&#x4ED6;&#x7684;&#x5730;&#x5740;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5730;&#x5740;&#xFF08;&#x5C3D;&#x7BA1;&#x5730;&#x5740;&#x4E5F;&#x662F;&#x72EC;&#x4E00;&#x65E0;&#x4E8C;&#x7684;&#xFF09;&#x5E76;&#x4E0D;&#x662F;&#x7528;&#x6765;&#x8BC1;&#x660E;&#x4F60;&#x662F;&#x4E00;&#x4E2A;&#x201C;&#x94B1;&#x5305;&#x201D;&#x6240;&#x6709;&#x8005;&#x7684;&#x4FE1;&#x7269;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x6240;&#x8C13;&#x7684;&#x5730;&#x5740;&#xFF0C;&#x53EA;&#x4E0D;&#x8FC7;&#x662F;&#x5C06;&#x516C;&#x94A5;&#x8868;&#x793A;&#x6210;&#x4EBA;&#x7C7B;&#x53EF;&#x8BFB;&#x7684;&#x5F62;&#x5F0F;&#x800C;&#x5DF2;&#xFF0C;&#x56E0;&#x4E3A;&#x539F;&#x751F;&#x7684;&#x516C;&#x94A5;&#x4EBA;&#x7C7B;&#x5F88;&#x96BE;&#x9605;&#x8BFB;&#x3002;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x4E2D;&#xFF0C;&#x4F60;&#x7684;&#x8EAB;&#x4EFD;&#xFF08;identity&#xFF09;&#x5C31;&#x662F;&#x4E00;&#x5BF9;&#xFF08;&#x6216;&#x8005;&#x591A;&#x5BF9;&#xFF09;&#x4FDD;&#x5B58;&#x5728;&#x4F60;&#x7684;&#x7535;&#x8111;&#xFF08;&#x6216;&#x8005;&#x4F60;&#x80FD;&#x591F;&#x83B7;&#x53D6;&#x5230;&#x7684;&#x5730;&#x65B9;&#xFF09;&#x4E0A;&#x7684;&#x516C;&#x94A5;&#xFF08;public key&#xFF09;&#x548C;&#x79C1;&#x94A5;&#xFF08;private key&#xFF09;&#x3002;&#x6BD4;&#x7279;&#x5E01;&#x57FA;&#x4E8E;&#x4E00;&#x4E9B;&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;&#x7684;&#x7EC4;&#x5408;&#x6765;&#x521B;&#x5EFA;&#x8FD9;&#x4E9B;&#x5BC6;&#x94A5;&#xFF0C;&#x5E76;&#x4E14;&#x4FDD;&#x8BC1;&#x4E86;&#x5728;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x4E0A;&#x6CA1;&#x6709;&#x5176;&#x4ED6;&#x4EBA;&#x80FD;&#x591F;&#x53D6;&#x8D70;&#x4F60;&#x7684;&#x5E01;&#xFF0C;&#x9664;&#x975E;&#x62FF;&#x5230;&#x4F60;&#x7684;&#x5BC6;&#x94A5;&#x3002;&#x4E0B;&#x9762;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x6765;&#x8BA8;&#x8BBA;&#x4E00;&#x4E0B;&#x8FD9;&#x4E9B;&#x7B97;&#x6CD5;&#x5230;&#x5E95;&#x662F;&#x4EC0;&#x4E48;&#x3002;</p>
<h2 id="&#x516C;&#x94A5;&#x52A0;&#x5BC6;">&#x516C;&#x94A5;&#x52A0;&#x5BC6;</h2>
<p>&#x516C;&#x94A5;&#x52A0;&#x5BC6;&#xFF08;public-key cryptography&#xFF09;&#x7B97;&#x6CD5;&#x4F7F;&#x7528;&#x7684;&#x662F;&#x6210;&#x5BF9;&#x7684;&#x5BC6;&#x94A5;&#xFF1A;&#x516C;&#x94A5;&#x548C;&#x79C1;&#x94A5;&#x3002;&#x516C;&#x94A5;&#x5E76;&#x4E0D;&#x662F;&#x654F;&#x611F;&#x4FE1;&#x606F;&#xFF0C;&#x53EF;&#x4EE5;&#x544A;&#x8BC9;&#x5176;&#x4ED6;&#x4EBA;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x79C1;&#x94A5;&#x7EDD;&#x5BF9;&#x4E0D;&#x80FD;&#x544A;&#x8BC9;&#x5176;&#x4ED6;&#x4EBA;&#xFF1A;&#x53EA;&#x6709;&#x6240;&#x6709;&#x8005;&#xFF08;owner&#xFF09;&#x624D;&#x80FD;&#x77E5;&#x9053;&#x79C1;&#x94A5;&#xFF0C;&#x80FD;&#x591F;&#x8BC6;&#x522B;&#xFF0C;&#x9274;&#x5B9A;&#x548C;&#x8BC1;&#x660E;&#x6240;&#x6709;&#x8005;&#x8EAB;&#x4EFD;&#x7684;&#x5C31;&#x662F;&#x79C1;&#x94A5;&#x3002;&#x5728;&#x52A0;&#x5BC6;&#x8D27;&#x5E01;&#x7684;&#x4E16;&#x754C;&#x4E2D;&#xFF0C;&#x4F60;&#x7684;&#x79C1;&#x94A5;&#x4EE3;&#x8868;&#x7684;&#x5C31;&#x662F;&#x4F60;&#xFF0C;&#x79C1;&#x94A5;&#x5C31;&#x662F;&#x4E00;&#x5207;&#x3002;</p>
<p>&#x672C;&#x8D28;&#x4E0A;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x94B1;&#x5305;&#x4E5F;&#x53EA;&#x4E0D;&#x8FC7;&#x662F;&#x8FD9;&#x6837;&#x7684;&#x5BC6;&#x94A5;&#x5BF9;&#x800C;&#x5DF2;&#x3002;&#x5F53;&#x4F60;&#x5B89;&#x88C5;&#x4E00;&#x4E2A;&#x94B1;&#x5305;&#x5E94;&#x7528;&#xFF0C;&#x6216;&#x662F;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#x5BA2;&#x6237;&#x7AEF;&#x6765;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x65B0;&#x5730;&#x5740;&#x65F6;&#xFF0C;&#x5B83;&#x5C31;&#x4F1A;&#x4E3A;&#x4F60;&#x751F;&#x6210;&#x4E00;&#x5BF9;&#x5BC6;&#x94A5;&#x3002;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x4E2D;&#xFF0C;&#x8C01;&#x62E5;&#x6709;&#x4E86;&#x79C1;&#x94A5;&#xFF0C;&#x8C01;&#x5C31;&#x53EF;&#x4EE5;&#x63A7;&#x5236;&#x6240;&#x6709;&#x53D1;&#x9001;&#x5230;&#x8FD9;&#x4E2A;&#x516C;&#x94A5;&#x7684;&#x5E01;&#x3002;</p>
<p>&#x79C1;&#x94A5;&#x548C;&#x516C;&#x94A5;&#x53EA;&#x4E0D;&#x8FC7;&#x662F;&#x968F;&#x673A;&#x7684;&#x5B57;&#x8282;&#x5E8F;&#x5217;&#xFF0C;&#x56E0;&#x6B64;&#x5B83;&#x4EEC;&#x65E0;&#x6CD5;&#x5728;&#x5C4F;&#x5E55;&#x4E0A;&#x6253;&#x5370;&#xFF0C;&#x4EBA;&#x7C7B;&#x4E5F;&#x65E0;&#x6CD5;&#x901A;&#x8FC7;&#x8089;&#x773C;&#x53BB;&#x8BFB;&#x53D6;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x6BD4;&#x7279;&#x5E01;&#x4F7F;&#x7528;&#x4E86;&#x4E00;&#x4E2A;&#x8F6C;&#x6362;&#x7B97;&#x6CD5;&#xFF0C;&#x5C06;&#x516C;&#x94A5;&#x8F6C;&#x5316;&#x4E3A;&#x4E00;&#x4E2A;&#x4EBA;&#x7C7B;&#x53EF;&#x8BFB;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#xFF08;&#x4E5F;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x770B;&#x5230;&#x7684;&#x5730;&#x5740;&#xFF09;&#x3002;</p>
<blockquote>
<p>&#x5982;&#x679C;&#x4F60;&#x7528;&#x8FC7;&#x6BD4;&#x7279;&#x5E01;&#x94B1;&#x5305;&#x5E94;&#x7528;&#xFF0C;&#x5F88;&#x53EF;&#x80FD;&#x5B83;&#x4F1A;&#x4E3A;&#x4F60;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x52A9;&#x8BB0;&#x7B26;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x52A9;&#x8BB0;&#x7B26;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x66FF;&#x4EE3;&#x79C1;&#x94A5;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x4EE5;&#x88AB;&#x7528;&#x4E8E;&#x751F;&#x6210;&#x79C1;&#x94A5;&#x3002;<a href="https://github.com/bitcoin/bips/blob/master/bip-0039.mediawiki" target="_blank">BIP-039</a> &#x5DF2;&#x7ECF;&#x5B9E;&#x73B0;&#x4E86;&#x8FD9;&#x4E2A;&#x673A;&#x5236;&#x3002;</p>
</blockquote>
<p>&#x597D;&#x4E86;&#xFF0C;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x77E5;&#x9053;&#x4E86;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x4E2D;&#x8BC1;&#x660E;&#x7528;&#x6237;&#x8EAB;&#x4EFD;&#x7684;&#x662F;&#x79C1;&#x94A5;&#x3002;&#x90A3;&#x4E48;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x5982;&#x4F55;&#x68C0;&#x67E5;&#x4EA4;&#x6613;&#x8F93;&#x51FA;&#xFF08;&#x548C;&#x5B58;&#x50A8;&#x5728;&#x91CC;&#x9762;&#x7684;&#x5E01;&#xFF09;&#x7684;&#x6240;&#x6709;&#x6743;&#x5462;&#xFF1F;</p>
<h2 id="&#x6570;&#x5B57;&#x7B7E;&#x540D;">&#x6570;&#x5B57;&#x7B7E;&#x540D;</h2>
<p>&#x5728;&#x6570;&#x5B66;&#x548C;&#x5BC6;&#x7801;&#x5B66;&#x4E2D;&#xFF0C;&#x6709;&#x4E00;&#x4E2A;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#xFF08;digital signature&#xFF09;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x7B97;&#x6CD5;&#x53EF;&#x4EE5;&#x4FDD;&#x8BC1;&#xFF1A;</p>
<ol>
<li>&#x5F53;&#x6570;&#x636E;&#x4ECE;&#x53D1;&#x9001;&#x65B9;&#x4F20;&#x9001;&#x5230;&#x63A5;&#x6536;&#x65B9;&#x65F6;&#xFF0C;&#x6570;&#x636E;&#x4E0D;&#x4F1A;&#x88AB;&#x4FEE;&#x6539;&#xFF1B;</li>
<li>&#x6570;&#x636E;&#x7531;&#x67D0;&#x4E00;&#x786E;&#x5B9A;&#x7684;&#x53D1;&#x9001;&#x65B9;&#x521B;&#x5EFA;&#xFF1B;</li>
<li>&#x53D1;&#x9001;&#x65B9;&#x65E0;&#x6CD5;&#x5426;&#x8BA4;&#x53D1;&#x9001;&#x8FC7;&#x6570;&#x636E;&#x8FD9;&#x4E00;&#x4E8B;&#x5B9E;&#x3002;</li>
</ol>
<p>&#x901A;&#x8FC7;&#x5728;&#x6570;&#x636E;&#x4E0A;&#x5E94;&#x7528;&#x7B7E;&#x540D;&#x7B97;&#x6CD5;&#xFF08;&#x4E5F;&#x5C31;&#x662F;&#x5BF9;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x7B7E;&#x540D;&#xFF09;&#xFF0C;&#x4F60;&#x5C31;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x7B7E;&#x540D;&#xFF0C;&#x8FD9;&#x4E2A;&#x7B7E;&#x540D;&#x665A;&#x4E9B;&#x65F6;&#x5019;&#x4F1A;&#x88AB;&#x9A8C;&#x8BC1;&#x3002;&#x751F;&#x6210;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x79C1;&#x94A5;&#xFF0C;&#x800C;&#x9A8C;&#x8BC1;&#x7B7E;&#x540D;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x516C;&#x94A5;&#x3002;&#x7B7E;&#x540D;&#x6709;&#x70B9;&#x7C7B;&#x4F3C;&#x4E8E;&#x5370;&#x7AE0;&#xFF0C;&#x6BD4;&#x65B9;&#x8BF4;&#x6211;&#x505A;&#x4E86;&#x4E00;&#x5E45;&#x753B;&#xFF0C;&#x5B8C;&#x4E86;&#x7528;&#x5370;&#x7AE0;&#x4E00;&#x76D6;&#xFF0C;&#x5C31;&#x8BF4;&#x660E;&#x4E86;&#x8FD9;&#x5E45;&#x753B;&#x662F;&#x6211;&#x7684;&#x4F5C;&#x54C1;&#x3002;&#x7ED9;&#x6570;&#x636E;&#x751F;&#x6210;&#x7B7E;&#x540D;&#xFF0C;&#x5C31;&#x662F;&#x7ED9;&#x6570;&#x636E;&#x76D6;&#x4E86;&#x7AE0;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x5BF9;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x7B7E;&#x540D;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4E0B;&#x9762;&#x4E24;&#x6837;&#x4E1C;&#x897F;&#xFF1A;</p>
<ol>
<li>&#x8981;&#x7B7E;&#x540D;&#x7684;&#x6570;&#x636E;</li>
<li>&#x79C1;&#x94A5;</li>
</ol>
<p>&#x5E94;&#x7528;&#x7B7E;&#x540D;&#x7B97;&#x6CD5;&#x53EF;&#x4EE5;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x7B7E;&#x540D;&#xFF0C;&#x5E76;&#x4E14;&#x8FD9;&#x4E2A;&#x7B7E;&#x540D;&#x4F1A;&#x88AB;&#x5B58;&#x50A8;&#x5728;&#x4EA4;&#x6613;&#x8F93;&#x5165;&#x4E2D;&#x3002;&#x4E3A;&#x4E86;&#x5BF9;&#x4E00;&#x4E2A;&#x7B7E;&#x540D;&#x8FDB;&#x884C;&#x9A8C;&#x8BC1;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4EE5;&#x4E0B;&#x4E09;&#x6837;&#x4E1C;&#x897F;&#xFF1A;</p>
<ol>
<li>&#x88AB;&#x7B7E;&#x540D;&#x7684;&#x6570;&#x636E;</li>
<li>&#x7B7E;&#x540D;</li>
<li>&#x516C;&#x94A5;</li>
</ol>
<p>&#x7B80;&#x5355;&#x6765;&#x8BF4;&#xFF0C;&#x9A8C;&#x8BC1;&#x8FC7;&#x7A0B;&#x53EF;&#x4EE5;&#x88AB;&#x63CF;&#x8FF0;&#x4E3A;&#xFF1A;&#x68C0;&#x67E5;&#x7B7E;&#x540D;&#x662F;&#x7531;&#x88AB;&#x7B7E;&#x540D;&#x6570;&#x636E;&#x52A0;&#x4E0A;&#x79C1;&#x94A5;&#x5F97;&#x6765;&#xFF0C;&#x5E76;&#x4E14;&#x516C;&#x94A5;&#x6070;&#x597D;&#x662F;&#x7531;&#x8BE5;&#x79C1;&#x94A5;&#x751F;&#x6210;&#x3002;</p>
<blockquote>
<p>&#x6570;&#x636E;&#x7B7E;&#x540D;&#x5E76;&#x4E0D;&#x662F;&#x52A0;&#x5BC6;&#xFF0C;&#x4F60;&#x65E0;&#x6CD5;&#x4ECE;&#x4E00;&#x4E2A;&#x7B7E;&#x540D;&#x91CD;&#x65B0;&#x6784;&#x9020;&#x51FA;&#x6570;&#x636E;&#x3002;&#x8FD9;&#x6709;&#x70B9;&#x50CF;&#x54C8;&#x5E0C;&#xFF1A;&#x4F60;&#x5728;&#x6570;&#x636E;&#x4E0A;&#x8FD0;&#x884C;&#x4E00;&#x4E2A;&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;&#xFF0C;&#x7136;&#x540E;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x8BE5;&#x6570;&#x636E;&#x7684;&#x552F;&#x4E00;&#x8868;&#x793A;&#x3002;&#x7B7E;&#x540D;&#x4E0E;&#x54C8;&#x5E0C;&#x7684;&#x533A;&#x522B;&#x5728;&#x4E8E;&#x5BC6;&#x94A5;&#x5BF9;&#xFF1A;&#x6709;&#x4E86;&#x5BC6;&#x94A5;&#x5BF9;&#xFF0C;&#x624D;&#x6709;&#x7B7E;&#x540D;&#x9A8C;&#x8BC1;&#x3002;&#x4F46;&#x662F;&#x5BC6;&#x94A5;&#x5BF9;&#x4E5F;&#x53EF;&#x4EE5;&#x88AB;&#x7528;&#x4E8E;&#x52A0;&#x5BC6;&#x6570;&#x636E;&#xFF1A;&#x79C1;&#x94A5;&#x7528;&#x4E8E;&#x52A0;&#x5BC6;&#xFF0C;&#x516C;&#x94A5;&#x7528;&#x4E8E;&#x89E3;&#x5BC6;&#x6570;&#x636E;&#x3002;&#x4E0D;&#x8FC7;&#x6BD4;&#x7279;&#x5E01;&#x5E76;&#x4E0D;&#x4F7F;&#x7528;&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;&#x3002;</p>
</blockquote>
<p>&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x4E2D;&#xFF0C;&#x6BCF;&#x4E00;&#x7B14;&#x4EA4;&#x6613;&#x8F93;&#x5165;&#x90FD;&#x4F1A;&#x7531;&#x521B;&#x5EFA;&#x4EA4;&#x6613;&#x7684;&#x4EBA;&#x7B7E;&#x540D;&#x3002;&#x5728;&#x88AB;&#x653E;&#x5165;&#x5230;&#x4E00;&#x4E2A;&#x5757;&#x4E4B;&#x524D;&#xFF0C;&#x5FC5;&#x987B;&#x8981;&#x5BF9;&#x6BCF;&#x4E00;&#x7B14;&#x4EA4;&#x6613;&#x8FDB;&#x884C;&#x9A8C;&#x8BC1;&#x3002;&#x9664;&#x4E86;&#x4E00;&#x4E9B;&#x5176;&#x4ED6;&#x6B65;&#x9AA4;&#xFF0C;&#x9A8C;&#x8BC1;&#x610F;&#x5473;&#x7740;&#xFF1A;</p>
<ol>
<li>&#x68C0;&#x67E5;&#x4EA4;&#x6613;&#x8F93;&#x5165;&#x6709;&#x6743;&#x4F7F;&#x7528;&#x6765;&#x81EA;&#x4E4B;&#x524D;&#x4EA4;&#x6613;&#x7684;&#x8F93;&#x51FA;</li>
<li>&#x68C0;&#x67E5;&#x4EA4;&#x6613;&#x7B7E;&#x540D;&#x662F;&#x6B63;&#x786E;&#x7684;</li>
</ol>
<p>&#x5982;&#x56FE;&#xFF0C;&#x5BF9;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x7B7E;&#x540D;&#x548C;&#x5BF9;&#x7B7E;&#x540D;&#x8FDB;&#x884C;&#x9A8C;&#x8BC1;&#x7684;&#x8FC7;&#x7A0B;&#x5927;&#x81F4;&#x5982;&#x4E0B;&#xFF1A;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/127313-ec45a7fca855f2e0.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="the process of signing data and verifying signature"></p>
<p>&#x73B0;&#x5728;&#x6765;&#x56DE;&#x987E;&#x4E00;&#x4E2A;&#x4EA4;&#x6613;&#x5B8C;&#x6574;&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;&#xFF1A;</p>
<ol>
<li><p>&#x8D77;&#x521D;&#xFF0C;&#x521B;&#x4E16;&#x5757;&#x91CC;&#x9762;&#x5305;&#x542B;&#x4E86;&#x4E00;&#x4E2A; coinbase &#x4EA4;&#x6613;&#x3002;&#x5728; coinbase &#x4EA4;&#x6613;&#x4E2D;&#xFF0C;&#x6CA1;&#x6709;&#x8F93;&#x5165;&#xFF0C;&#x6240;&#x4EE5;&#x4E5F;&#x5C31;&#x4E0D;&#x9700;&#x8981;&#x7B7E;&#x540D;&#x3002;coinbase &#x4EA4;&#x6613;&#x7684;&#x8F93;&#x51FA;&#x5305;&#x542B;&#x4E86;&#x4E00;&#x4E2A;&#x54C8;&#x5E0C;&#x8FC7;&#x7684;&#x516C;&#x94A5;&#xFF08;&#x4F7F;&#x7528;&#x7684;&#x662F;
<strong>RIPEMD16(SHA256(PubKey))</strong> &#x7B97;&#x6CD5;&#xFF09;</p>
</li>
<li><p>&#x5F53;&#x4E00;&#x4E2A;&#x4EBA;&#x53D1;&#x9001;&#x5E01;&#x65F6;&#xFF0C;&#x5C31;&#x4F1A;&#x521B;&#x5EFA;&#x4E00;&#x7B14;&#x4EA4;&#x6613;&#x3002;&#x8FD9;&#x7B14;&#x4EA4;&#x6613;&#x7684;&#x8F93;&#x5165;&#x4F1A;&#x5F15;&#x7528;&#x4E4B;&#x524D;&#x4EA4;&#x6613;&#x7684;&#x8F93;&#x51FA;&#x3002;&#x6BCF;&#x4E2A;&#x8F93;&#x5165;&#x4F1A;&#x5B58;&#x50A8;&#x4E00;&#x4E2A;&#x516C;&#x94A5;&#xFF08;&#x6CA1;&#x6709;&#x88AB;&#x54C8;&#x5E0C;&#xFF09;&#x548C;&#x6574;&#x4E2A;&#x4EA4;&#x6613;&#x7684;&#x4E00;&#x4E2A;&#x7B7E;&#x540D;&#x3002;</p>
</li>
<li><p>&#x6BD4;&#x7279;&#x5E01;&#x7F51;&#x7EDC;&#x4E2D;&#x63A5;&#x6536;&#x5230;&#x4EA4;&#x6613;&#x7684;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#x4F1A;&#x5BF9;&#x8BE5;&#x4EA4;&#x6613;&#x8FDB;&#x884C;&#x9A8C;&#x8BC1;&#x3002;&#x9664;&#x4E86;&#x4E00;&#x4E9B;&#x5176;&#x4ED6;&#x4E8B;&#x60C5;&#xFF0C;&#x4ED6;&#x4EEC;&#x8FD8;&#x4F1A;&#x68C0;&#x67E5;&#xFF1A;&#x5728;&#x4E00;&#x4E2A;&#x8F93;&#x5165;&#x4E2D;&#xFF0C;&#x516C;&#x94A5;&#x54C8;&#x5E0C;&#x4E0E;&#x6240;&#x5F15;&#x7528;&#x7684;&#x8F93;&#x51FA;&#x54C8;&#x5E0C;&#x76F8;&#x5339;&#x914D;&#xFF08;&#x8FD9;&#x4FDD;&#x8BC1;&#x4E86;&#x53D1;&#x9001;&#x65B9;&#x53EA;&#x80FD;&#x82B1;&#x8D39;&#x5C5E;&#x4E8E;&#x81EA;&#x5DF1;&#x7684;&#x5E01;&#xFF09;&#xFF1B;&#x7B7E;&#x540D;&#x662F;&#x6B63;&#x786E;&#x7684;&#xFF08;&#x8FD9;&#x4FDD;&#x8BC1;&#x4E86;&#x4EA4;&#x6613;&#x662F;&#x7531;&#x5E01;&#x7684;&#x5B9E;&#x9645;&#x62E5;&#x6709;&#x8005;&#x6240;&#x521B;&#x5EFA;&#xFF09;&#x3002;</p>
</li>
<li><p>&#x5F53;&#x4E00;&#x4E2A;&#x77FF;&#x5DE5;&#x51C6;&#x5907;&#x6316;&#x4E00;&#x4E2A;&#x65B0;&#x5757;&#x65F6;&#xFF0C;&#x4ED6;&#x4F1A;&#x5C06;&#x4EA4;&#x6613;&#x653E;&#x5230;&#x5757;&#x4E2D;&#xFF0C;&#x7136;&#x540E;&#x5F00;&#x59CB;&#x6316;&#x77FF;&#x3002;</p>
</li>
<li><p>&#x5F53;&#x65B0;&#x5757;&#x88AB;&#x6316;&#x51FA;&#x6765;&#x4EE5;&#x540E;&#xFF0C;&#x7F51;&#x7EDC;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#x4F1A;&#x63A5;&#x6536;&#x5230;&#x4E00;&#x6761;&#x6D88;&#x606F;&#xFF0C;&#x544A;&#x8BC9;&#x5176;&#x4ED6;&#x4EBA;&#x8FD9;&#x4E2A;&#x5757;&#x5DF2;&#x7ECF;&#x88AB;&#x6316;&#x51FA;&#x5E76;&#x88AB;&#x52A0;&#x5165;&#x5230;&#x533A;&#x5757;&#x94FE;&#x3002;</p>
</li>
<li><p>&#x5F53;&#x4E00;&#x4E2A;&#x5757;&#x88AB;&#x52A0;&#x5165;&#x5230;&#x533A;&#x5757;&#x94FE;&#x4EE5;&#x540E;&#xFF0C;&#x4EA4;&#x6613;&#x5C31;&#x7B97;&#x5B8C;&#x6210;&#xFF0C;&#x5B83;&#x7684;&#x8F93;&#x51FA;&#x5C31;&#x53EF;&#x4EE5;&#x5728;&#x65B0;&#x7684;&#x4EA4;&#x6613;&#x4E2D;&#x88AB;&#x5F15;&#x7528;&#x3002;</p>
</li>
</ol>
<h2 id="&#x692D;&#x5706;&#x66F2;&#x7EBF;&#x52A0;&#x5BC6;">&#x692D;&#x5706;&#x66F2;&#x7EBF;&#x52A0;&#x5BC6;</h2>
<p>&#x6B63;&#x5982;&#x4E4B;&#x524D;&#x63D0;&#x5230;&#x7684;&#xFF0C;&#x516C;&#x94A5;&#x548C;&#x79C1;&#x94A5;&#x662F;&#x968F;&#x673A;&#x7684;&#x5B57;&#x8282;&#x5E8F;&#x5217;&#x3002;&#x79C1;&#x94A5;&#x80FD;&#x591F;&#x7528;&#x4E8E;&#x8BC1;&#x660E;&#x6301;&#x5E01;&#x4EBA;&#x7684;&#x8EAB;&#x4EFD;&#xFF0C;&#x9700;&#x8981;&#x6709;&#x4E00;&#x4E2A;&#x6761;&#x4EF6;&#xFF1A;&#x968F;&#x673A;&#x7B97;&#x6CD5;&#x5FC5;&#x987B;&#x751F;&#x6210;&#x771F;&#x6B63;&#x968F;&#x673A;&#x7684;&#x5B57;&#x8282;&#x3002;&#x56E0;&#x4E3A;&#x6CA1;&#x6709;&#x4EBA;&#x4F1A;&#x60F3;&#x8981;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x79C1;&#x94A5;&#xFF0C;&#x800C;&#x8FD9;&#x4E2A;&#x79C1;&#x94A5;&#x610F;&#x5916;&#x5730;&#x4E5F;&#x88AB;&#x522B;&#x4EBA;&#x6240;&#x6709;&#x3002;</p>
<p>&#x6BD4;&#x7279;&#x5E01;&#x4F7F;&#x7528;&#x692D;&#x5706;&#x66F2;&#x7EBF;&#x6765;&#x4EA7;&#x751F;&#x79C1;&#x94A5;&#x3002;&#x692D;&#x5706;&#x66F2;&#x7EBF;&#x662F;&#x4E00;&#x4E2A;&#x590D;&#x6742;&#x7684;&#x6570;&#x5B66;&#x6982;&#x5FF5;&#xFF0C;&#x6211;&#x4EEC;&#x5E76;&#x4E0D;&#x6253;&#x7B97;&#x5728;&#x8FD9;&#x91CC;&#x4F5C;&#x592A;&#x591A;&#x89E3;&#x91CA;&#xFF08;&#x5982;&#x679C;&#x4F60;&#x771F;&#x7684;&#x5341;&#x5206;&#x597D;&#x5947;&#xFF0C;&#x53EF;&#x4EE5;&#x67E5;&#x770B;<a href="http://andrea.corbellini.name/2015/05/17/elliptic-curve-cryptography-a-gentle-introduction/" target="_blank">&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;</a>&#xFF0C;&#x6CE8;&#x610F;&#xFF1A;&#x6709;&#x5F88;&#x591A;&#x6570;&#x5B66;&#x516C;&#x5F0F;&#xFF01;&#xFF09;&#x6211;&#x4EEC;&#x53EA;&#x8981;&#x77E5;&#x9053;&#x8FD9;&#x4E9B;&#x66F2;&#x7EBF;&#x53EF;&#x4EE5;&#x751F;&#x6210;&#x975E;&#x5E38;&#x5927;&#x7684;&#x968F;&#x673A;&#x6570;&#x5C31;&#x591F;&#x4E86;&#x3002;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x4E2D;&#x4F7F;&#x7528;&#x7684;&#x66F2;&#x7EBF;&#x53EF;&#x4EE5;&#x968F;&#x673A;&#x9009;&#x53D6;&#x5728; 0 &#x4E0E; 2 ^ 2 ^ 56&#xFF08;&#x5927;&#x6982;&#x662F; 10^77, &#x800C;&#x6574;&#x4E2A;&#x53EF;&#x89C1;&#x7684;&#x5B87;&#x5B99;&#x4E2D;&#xFF0C;&#x539F;&#x5B50;&#x6570;&#x5728; 10^78 &#x5230; 10^82 &#x4E4B;&#x95F4;&#xFF09; &#x7684;&#x4E00;&#x4E2A;&#x6570;&#x3002;&#x6709;&#x5982;&#x6B64;&#x9AD8;&#x7684;&#x4E00;&#x4E2A;&#x4E0A;&#x9650;&#xFF0C;&#x610F;&#x5473;&#x7740;&#x51E0;&#x4E4E;&#x4E0D;&#x53EF;&#x80FD;&#x53D1;&#x751F;&#x6709;&#x4E24;&#x6B21;&#x751F;&#x6210;&#x540C;&#x4E00;&#x4E2A;&#x79C1;&#x94A5;&#x7684;&#x4E8B;&#x60C5;&#x3002;</p>
<p>&#x6BD4;&#x7279;&#x5E01;&#x4F7F;&#x7528;&#x7684;&#x662F; ECDSA&#xFF08;Elliptic Curve Digital Signature Algorithm&#xFF09;&#x7B97;&#x6CD5;&#x6765;&#x5BF9;&#x4EA4;&#x6613;&#x8FDB;&#x884C;&#x7B7E;&#x540D;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x4F1A;&#x4F7F;&#x7528;&#x8BE5;&#x7B97;&#x6CD5;&#x3002;</p>
<h2 id="base58">Base58</h2>
<p>&#x56DE;&#x5230;&#x4E0A;&#x9762;&#x63D0;&#x5230;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#xFF1A;1A1zP1eP5QGefi2DMPTfTL5SLmv7DivfNa &#x3002;&#x73B0;&#x5728;&#xFF0C;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x77E5;&#x9053;&#x4E86;&#x8FD9;&#x662F;&#x516C;&#x94A5;&#x7528;&#x4EBA;&#x7C7B;&#x53EF;&#x8BFB;&#x7684;&#x5F62;&#x5F0F;&#x8868;&#x793A;&#x800C;&#x5DF2;&#x3002;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x5BF9;&#x5B83;&#x8FDB;&#x884C;&#x89E3;&#x7801;&#xFF0C;&#x5C31;&#x4F1A;&#x770B;&#x5230;&#x516C;&#x94A5;&#x7684;&#x672C;&#x6765;&#x9762;&#x76EE;&#xFF08;16 &#x8FDB;&#x5236;&#x8868;&#x793A;&#x7684;&#x5B57;&#x8282;&#xFF09;&#xFF1A;</p>
<pre><code>0062E907B15CBF27D5425399EBF6F0FB50EBB88F18C29B7D93
</code></pre><p>&#x6BD4;&#x7279;&#x5E01;&#x4F7F;&#x7528; Base58 &#x7B97;&#x6CD5;&#x5C06;&#x516C;&#x94A5;&#x8F6C;&#x6362;&#x6210;&#x4EBA;&#x7C7B;&#x53EF;&#x8BFB;&#x7684;&#x5F62;&#x5F0F;&#x3002;&#x8FD9;&#x4E2A;&#x7B97;&#x6CD5;&#x8DDF;&#x8457;&#x540D;&#x7684; Base64 &#x5F88;&#x7C7B;&#x4F3C;&#xFF0C;&#x533A;&#x522B;&#x5728;&#x4E8E;&#x5B83;&#x4F7F;&#x7528;&#x4E86;&#x66F4;&#x77ED;&#x7684;&#x5B57;&#x6BCD;&#x8868;&#xFF1A;&#x4E3A;&#x4E86;&#x907F;&#x514D;&#x4E00;&#x4E9B;&#x5229;&#x7528;&#x5B57;&#x6BCD;&#x76F8;&#x4F3C;&#x6027;&#x7684;&#x653B;&#x51FB;&#xFF0C;&#x4ECE;&#x5B57;&#x6BCD;&#x8868;&#x4E2D;&#x79FB;&#x9664;&#x4E86;&#x4E00;&#x4E9B;&#x5B57;&#x6BCD;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#xFF0C;&#x6CA1;&#x6709;&#x8FD9;&#x4E9B;&#x7B26;&#x53F7;&#xFF1A;0(&#x96F6;)&#xFF0C;O(&#x5927;&#x5199;&#x7684; o)&#xFF0C;I(&#x5927;&#x5199;&#x7684;i)&#xFF0C;l(&#x5C0F;&#x5199;&#x7684; L)&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x51E0;&#x4E2A;&#x5B57;&#x6BCD;&#x770B;&#x7740;&#x5F88;&#x50CF;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709; + &#x548C; / &#x7B26;&#x53F7;&#x3002;</p>
<p>&#x4E0B;&#x56FE;&#x662F;&#x4ECE;&#x4E00;&#x4E2A;&#x516C;&#x94A5;&#x83B7;&#x5F97;&#x4E00;&#x4E2A;&#x5730;&#x5740;&#x7684;&#x8FC7;&#x7A0B;&#xFF1A;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/127313-6aa6cff5d863d496.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="get an address from a public key"></p>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x4E0A;&#x9762;&#x63D0;&#x5230;&#x7684;&#x516C;&#x94A5;&#x89E3;&#x7801;&#x540E;&#x5305;&#x542B;&#x4E09;&#x4E2A;&#x90E8;&#x5206;&#xFF1A;</p>
<pre><code>Version  Public key hash                           Checksum
00       62E907B15CBF27D5425399EBF6F0FB50EBB88F18  C29B7D93
</code></pre><p>&#x7531;&#x4E8E;&#x54C8;&#x5E0C;&#x51FD;&#x6570;&#x662F;&#x5355;&#x5411;&#x7684;&#xFF08;&#x4E5F;&#x5C31;&#x8BF4;&#x65E0;&#x6CD5;&#x9006;&#x8F6C;&#x56DE;&#x53BB;&#xFF09;&#xFF0C;&#x6240;&#x4EE5;&#x4E0D;&#x53EF;&#x80FD;&#x4ECE;&#x4E00;&#x4E2A;&#x54C8;&#x5E0C;&#x4E2D;&#x63D0;&#x53D6;&#x516C;&#x94A5;&#x3002;&#x4E0D;&#x8FC7;&#x901A;&#x8FC7;&#x6267;&#x884C;&#x54C8;&#x5E0C;&#x51FD;&#x6570;&#x5E76;&#x8FDB;&#x884C;&#x54C8;&#x5E0C;&#x6BD4;&#x8F83;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x68C0;&#x67E5;&#x4E00;&#x4E2A;&#x516C;&#x94A5;&#x662F;&#x5426;&#x88AB;&#x7528;&#x4E8E;&#x54C8;&#x5E0C;&#x7684;&#x751F;&#x6210;&#x3002;</p>
<p>&#x597D;&#x4E86;&#xFF0C;&#x6240;&#x6709;&#x7EC6;&#x8282;&#x90FD;&#x5DF2;&#x5C31;&#x7EEA;&#xFF0C;&#x6765;&#x5199;&#x4EE3;&#x7801;&#x5427;&#x3002;&#x5F88;&#x591A;&#x6982;&#x5FF5;&#x53EA;&#x6709;&#x5F53;&#x5199;&#x4EE3;&#x7801;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x624D;&#x80FD;&#x7406;&#x89E3;&#x5730;&#x66F4;&#x900F;&#x5F7B;&#x3002;</p>
<h2 id="&#x5B9E;&#x73B0;&#x5730;&#x5740;">&#x5B9E;&#x73B0;&#x5730;&#x5740;</h2>
<p>&#x6211;&#x4EEC;&#x5148;&#x4ECE;&#x94B1;&#x5305; <code>Wallet</code> &#x7ED3;&#x6784;&#x5F00;&#x59CB;&#xFF1A;</p>
<pre><code class="lang-go"><span class="hljs-keyword">type</span> Wallet <span class="hljs-keyword">struct</span> {
    PrivateKey ecdsa.PrivateKey
    PublicKey  []<span class="hljs-keyword">byte</span>
}

<span class="hljs-keyword">type</span> Wallets <span class="hljs-keyword">struct</span> {
    Wallets <span class="hljs-keyword">map</span>[<span class="hljs-keyword">string</span>]*Wallet
}

<span class="hljs-keyword">func</span> NewWallet() *Wallet {
    private, public := newKeyPair()
    wallet := Wallet{private, public}

    <span class="hljs-keyword">return</span> &amp;wallet
}

<span class="hljs-keyword">func</span> newKeyPair() (ecdsa.PrivateKey, []<span class="hljs-keyword">byte</span>) {
    curve := elliptic.P256()
    private, err := ecdsa.GenerateKey(curve, rand.Reader)
    pubKey := <span class="hljs-built_in">append</span>(private.PublicKey.X.Bytes(), private.PublicKey.Y.Bytes()...)

    <span class="hljs-keyword">return</span> *private, pubKey
}
</code></pre>
<p>&#x4E00;&#x4E2A;&#x94B1;&#x5305;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x5BC6;&#x94A5;&#x5BF9;&#x800C;&#x5DF2;&#x3002;&#x6211;&#x4EEC;&#x9700;&#x8981; <code>Wallets</code> &#x7C7B;&#x578B;&#x6765;&#x4FDD;&#x5B58;&#x591A;&#x4E2A;&#x94B1;&#x5305;&#x7684;&#x7EC4;&#x5408;&#xFF0C;&#x5C06;&#x5B83;&#x4EEC;&#x4FDD;&#x5B58;&#x5230;&#x6587;&#x4EF6;&#x4E2D;&#xFF0C;&#x6216;&#x8005;&#x4ECE;&#x6587;&#x4EF6;&#x4E2D;&#x8FDB;&#x884C;&#x52A0;&#x8F7D;&#x3002;<code>Wallet</code> &#x7684;&#x6784;&#x9020;&#x51FD;&#x6570;&#x4F1A;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x5BC6;&#x94A5;&#x5BF9;&#x3002;<code>newKeyPair</code> &#x51FD;&#x6570;&#x975E;&#x5E38;&#x76F4;&#x89C2;&#xFF1A;ECDSA &#x57FA;&#x4E8E;&#x692D;&#x5706;&#x66F2;&#x7EBF;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x692D;&#x5706;&#x66F2;&#x7EBF;&#x3002;&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x4F7F;&#x7528;&#x692D;&#x5706;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x79C1;&#x94A5;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x4ECE;&#x79C1;&#x94A5;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x516C;&#x94A5;&#x3002;&#x6709;&#x4E00;&#x70B9;&#x9700;&#x8981;&#x6CE8;&#x610F;&#xFF1A;&#x5728;&#x57FA;&#x4E8E;&#x692D;&#x5706;&#x66F2;&#x7EBF;&#x7684;&#x7B97;&#x6CD5;&#x4E2D;&#xFF0C;&#x516C;&#x94A5;&#x662F;&#x66F2;&#x7EBF;&#x4E0A;&#x7684;&#x70B9;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x516C;&#x94A5;&#x662F; X&#xFF0C;Y &#x5750;&#x6807;&#x7684;&#x7EC4;&#x5408;&#x3002;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x4E2D;&#xFF0C;&#x8FD9;&#x4E9B;&#x5750;&#x6807;&#x4F1A;&#x88AB;&#x8FDE;&#x63A5;&#x8D77;&#x6765;&#xFF0C;&#x7136;&#x540E;&#x5F62;&#x6210;&#x4E00;&#x4E2A;&#x516C;&#x94A5;&#x3002;</p>
<p>&#x73B0;&#x5728;&#xFF0C;&#x6765;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x5730;&#x5740;&#xFF1A;</p>
<pre><code class="lang-go"><span class="hljs-keyword">func</span> (w Wallet) GetAddress() []<span class="hljs-keyword">byte</span> {
    pubKeyHash := HashPubKey(w.PublicKey)

    versionedPayload := <span class="hljs-built_in">append</span>([]<span class="hljs-keyword">byte</span>{version}, pubKeyHash...)
    checksum := checksum(versionedPayload)

    fullPayload := <span class="hljs-built_in">append</span>(versionedPayload, checksum...)
    address := Base58Encode(fullPayload)

    <span class="hljs-keyword">return</span> address
}

<span class="hljs-keyword">func</span> HashPubKey(pubKey []<span class="hljs-keyword">byte</span>) []<span class="hljs-keyword">byte</span> {
    publicSHA256 := sha256.Sum256(pubKey)

    RIPEMD160Hasher := ripemd160.New()
    _, err := RIPEMD160Hasher.Write(publicSHA256[:])
    publicRIPEMD160 := RIPEMD160Hasher.Sum(<span class="hljs-literal">nil</span>)

    <span class="hljs-keyword">return</span> publicRIPEMD160
}

<span class="hljs-keyword">func</span> checksum(payload []<span class="hljs-keyword">byte</span>) []<span class="hljs-keyword">byte</span> {
    firstSHA := sha256.Sum256(payload)
    secondSHA := sha256.Sum256(firstSHA[:])

    <span class="hljs-keyword">return</span> secondSHA[:addressChecksumLen]
}
</code></pre>
<p>&#x5C06;&#x4E00;&#x4E2A;&#x516C;&#x94A5;&#x8F6C;&#x6362;&#x6210;&#x4E00;&#x4E2A; Base58 &#x5730;&#x5740;&#x9700;&#x8981;&#x4EE5;&#x4E0B;&#x6B65;&#x9AA4;&#xFF1A;</p>
<ol>
<li><p>&#x4F7F;&#x7528; <code>RIPEMD160(SHA256(PubKey))</code> &#x54C8;&#x5E0C;&#x7B97;&#x6CD5;&#xFF0C;&#x53D6;&#x516C;&#x94A5;&#x5E76;&#x5BF9;&#x5176;&#x54C8;&#x5E0C;&#x4E24;&#x6B21;</p>
</li>
<li><p>&#x7ED9;&#x54C8;&#x5E0C;&#x52A0;&#x4E0A;&#x5730;&#x5740;&#x751F;&#x6210;&#x7B97;&#x6CD5;&#x7248;&#x672C;&#x7684;&#x524D;&#x7F00;</p>
</li>
<li><p>&#x5BF9;&#x4E8E;&#x7B2C;&#x4E8C;&#x6B65;&#x751F;&#x6210;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x4F7F;&#x7528; <code>SHA256(SHA256(payload))</code> &#x518D;&#x54C8;&#x5E0C;&#xFF0C;&#x8BA1;&#x7B97;&#x6821;&#x9A8C;&#x548C;&#x3002;&#x6821;&#x9A8C;&#x548C;&#x662F;&#x7ED3;&#x679C;&#x54C8;&#x5E0C;&#x7684;&#x524D;&#x56DB;&#x4E2A;&#x5B57;&#x8282;&#x3002;</p>
</li>
<li><p>&#x5C06;&#x6821;&#x9A8C;&#x548C;&#x9644;&#x52A0;&#x5230; <code>version+PubKeyHash</code> &#x7684;&#x7EC4;&#x5408;&#x4E2D;&#x3002;</p>
</li>
<li><p>&#x4F7F;&#x7528; Base58 &#x5BF9; <code>version+PubKeyHash+checksum</code> &#x7EC4;&#x5408;&#x8FDB;&#x884C;&#x7F16;&#x7801;&#x3002;</p>
</li>
</ol>
<p>&#x81F3;&#x6B64;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x4E00;&#x4E2A;<strong>&#x771F;&#x5B9E;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;</strong>&#xFF0C;&#x4F60;&#x751A;&#x81F3;&#x53EF;&#x4EE5;&#x5728; <a href="https://blockchain.info/" target="_blank">blockchain.info</a> &#x67E5;&#x770B;&#x5B83;&#x7684;&#x4F59;&#x989D;&#x3002;&#x4E0D;&#x8FC7;&#x6211;&#x53EF;&#x4EE5;&#x8D1F;&#x8D23;&#x4EFB;&#x5730;&#x8BF4;&#xFF0C;&#x65E0;&#x8BBA;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x5730;&#x5740;&#x591A;&#x5C11;&#x6B21;&#xFF0C;&#x68C0;&#x67E5;&#x5B83;&#x7684;&#x4F59;&#x989D;&#x90FD;&#x662F; 0&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x5408;&#x9002;&#x7684;&#x516C;&#x94A5;&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;&#x662F;&#x5982;&#x6B64;&#x91CD;&#x8981;&#xFF1A;&#x8003;&#x8651;&#x5230;&#x79C1;&#x94A5;&#x662F;&#x968F;&#x673A;&#x6570;&#xFF0C;&#x751F;&#x6210;&#x540C;&#x4E00;&#x4E2A;&#x6570;&#x5B57;&#x7684;&#x6982;&#x7387;&#x5FC5;&#x987B;&#x662F;&#x5C3D;&#x53EF;&#x80FD;&#x5730;&#x4F4E;&#x3002;&#x7406;&#x60F3;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5FC5;&#x987B;&#x662F;&#x4F4E;&#x5230;&#x201C;&#x6C38;&#x8FDC;&#x201D;&#x4E0D;&#x4F1A;&#x91CD;&#x590D;&#x3002;</p>
<p>&#x53E6;&#x5916;&#xFF0C;&#x6CE8;&#x610F;&#xFF1A;&#x4F60;&#x5E76;&#x4E0D;&#x9700;&#x8981;&#x8FDE;&#x63A5;&#x5230;&#x4E00;&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#x8282;&#x70B9;&#x6765;&#x83B7;&#x5F97;&#x4E00;&#x4E2A;&#x5730;&#x5740;&#x3002;&#x5730;&#x5740;&#x751F;&#x6210;&#x7B97;&#x6CD5;&#x4F7F;&#x7528;&#x7684;&#x591A;&#x79CD;&#x5F00;&#x6E90;&#x7B97;&#x6CD5;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5F88;&#x591A;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x548C;&#x5E93;&#x5B9E;&#x73B0;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4FEE;&#x6539;&#x8F93;&#x5165;&#x548C;&#x8F93;&#x51FA;&#x6765;&#x4F7F;&#x7528;&#x5730;&#x5740;&#xFF1A;</p>
<pre><code class="lang-go"><span class="hljs-keyword">type</span> TXInput <span class="hljs-keyword">struct</span> {
    Txid      []<span class="hljs-keyword">byte</span>
    Vout      <span class="hljs-keyword">int</span>
    Signature []<span class="hljs-keyword">byte</span>
    PubKey    []<span class="hljs-keyword">byte</span>
}

<span class="hljs-keyword">func</span> (in *TXInput) UsesKey(pubKeyHash []<span class="hljs-keyword">byte</span>) <span class="hljs-keyword">bool</span> {
    lockingHash := HashPubKey(in.PubKey)

    <span class="hljs-keyword">return</span> bytes.Compare(lockingHash, pubKeyHash) == <span class="hljs-number">0</span>
}

<span class="hljs-keyword">type</span> TXOutput <span class="hljs-keyword">struct</span> {
    Value      <span class="hljs-keyword">int</span>
    PubKeyHash []<span class="hljs-keyword">byte</span>
}

<span class="hljs-keyword">func</span> (out *TXOutput) Lock(address []<span class="hljs-keyword">byte</span>) {
    pubKeyHash := Base58Decode(address)
    pubKeyHash = pubKeyHash[<span class="hljs-number">1</span> : <span class="hljs-built_in">len</span>(pubKeyHash)<span class="hljs-number">-4</span>]
    out.PubKeyHash = pubKeyHash
}

<span class="hljs-keyword">func</span> (out *TXOutput) IsLockedWithKey(pubKeyHash []<span class="hljs-keyword">byte</span>) <span class="hljs-keyword">bool</span> {
    <span class="hljs-keyword">return</span> bytes.Compare(out.PubKeyHash, pubKeyHash) == <span class="hljs-number">0</span>
}
</code></pre>
<p>&#x6CE8;&#x610F;&#xFF0C;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x4E0D;&#x518D;&#x9700;&#x8981; <code>ScriptPubKey</code> &#x548C; <code>ScriptSig</code> &#x5B57;&#x6BB5;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x4E0D;&#x4F1A;&#x5B9E;&#x73B0;&#x4E00;&#x4E2A;&#x811A;&#x672C;&#x8BED;&#x8A00;&#x3002;&#x76F8;&#x53CD;&#xFF0C;<code>ScriptSig</code> &#x4F1A;&#x88AB;&#x5206;&#x4E3A; <code>Signature</code> &#x548C; <code>PubKey</code> &#x5B57;&#x6BB5;&#xFF0C;<code>ScriptPubKey</code> &#x88AB;&#x91CD;&#x547D;&#x540D;&#x4E3A; <code>PubKeyHash</code>&#x3002;&#x6211;&#x4EEC;&#x4F1A;&#x5B9E;&#x73B0;&#x8DDF;&#x6BD4;&#x7279;&#x5E01;&#x91CC;&#x4E00;&#x6837;&#x7684;&#x8F93;&#x51FA;&#x9501;&#x5B9A;/&#x89E3;&#x9501;&#x548C;&#x8F93;&#x5165;&#x7B7E;&#x540D;&#x903B;&#x8F91;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x662F;&#x6211;&#x4EEC;&#x4F1A;&#x901A;&#x8FC7;&#x65B9;&#x6CD5;&#xFF08;method&#xFF09;&#x6765;&#x5B9E;&#x73B0;&#x3002;</p>
<p><code>UsesKey</code> &#x65B9;&#x6CD5;&#x68C0;&#x67E5;&#x8F93;&#x5165;&#x4F7F;&#x7528;&#x4E86;&#x6307;&#x5B9A;&#x5BC6;&#x94A5;&#x6765;&#x89E3;&#x9501;&#x4E00;&#x4E2A;&#x8F93;&#x51FA;&#x3002;&#x6CE8;&#x610F;&#x5230;&#x8F93;&#x5165;&#x5B58;&#x50A8;&#x7684;&#x662F;&#x539F;&#x751F;&#x7684;&#x516C;&#x94A5;&#xFF08;&#x4E5F;&#x5C31;&#x662F;&#x6CA1;&#x6709;&#x88AB;&#x54C8;&#x5E0C;&#x7684;&#x516C;&#x94A5;&#xFF09;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x8981;&#x6C42;&#x7684;&#x662F;&#x54C8;&#x5E0C;&#x540E;&#x7684;&#x516C;&#x94A5;&#x3002;<code>IsLockedWithKey</code> &#x68C0;&#x67E5;&#x662F;&#x5426;&#x63D0;&#x4F9B;&#x7684;&#x516C;&#x94A5;&#x54C8;&#x5E0C;&#x88AB;&#x7528;&#x4E8E;&#x9501;&#x5B9A;&#x8F93;&#x51FA;&#x3002;&#x8FD9;&#x662F;&#x4E00;&#x4E2A; <code>UsesKey</code> &#x7684;&#x8F85;&#x52A9;&#x51FD;&#x6570;&#xFF0C;&#x5E76;&#x4E14;&#x5B83;&#x4EEC;&#x90FD;&#x88AB;&#x7528;&#x4E8E; <code>FindUnspentTransactions</code> &#x6765;&#x5F62;&#x6210;&#x4EA4;&#x6613;&#x4E4B;&#x95F4;&#x7684;&#x8054;&#x7CFB;&#x3002;</p>
<p><code>Lock</code> &#x53EA;&#x662F;&#x7B80;&#x5355;&#x5730;&#x9501;&#x5B9A;&#x4E86;&#x4E00;&#x4E2A;&#x8F93;&#x51FA;&#x3002;&#x5F53;&#x6211;&#x4EEC;&#x7ED9;&#x67D0;&#x4E2A;&#x4EBA;&#x53D1;&#x9001;&#x5E01;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x77E5;&#x9053;&#x4ED6;&#x7684;&#x5730;&#x5740;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x5730;&#x5740;&#x4F5C;&#x4E3A;&#x552F;&#x4E00;&#x7684;&#x53C2;&#x6570;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x5730;&#x5740;&#x4F1A;&#x88AB;&#x89E3;&#x7801;&#xFF0C;&#x4ECE;&#x4E2D;&#x63D0;&#x53D6;&#x51FA;&#x516C;&#x94A5;&#x54C8;&#x5E0C;&#x5E76;&#x4FDD;&#x5B58;&#x5728; <code>PubKeyHash</code> &#x5B57;&#x6BB5;&#x3002;</p>
<p>&#x73B0;&#x5728;&#xFF0C;&#x6765;&#x68C0;&#x67E5;&#x4E00;&#x4E0B;&#x662F;&#x5426;&#x90FD;&#x80FD;&#x5982;&#x671F;&#x5DE5;&#x4F5C;&#xFF1A;</p>
<pre><code class="lang-bash">$ blockchain_go createwallet
Your new address: 13Uu7B1vDP4ViXqHFsWtbraM3EfQ3UkWXt

$ blockchain_go createwallet
Your new address: 15pUhCbtrGh3JUx5iHnXjfpyHyTgawvG5h

$ blockchain_go createwallet
Your new address: 1Lhqun1E9zZZhodiTqxfPQBcwr1CVDV2sy

$ blockchain_go createblockchain -address 13Uu7B1vDP4ViXqHFsWtbraM3EfQ3UkWXt
0000005420fbfdafa00c093f56e033903ba43599fa7<span class="hljs-built_in">cd</span>9df40458e373eee724d

Done!

$ blockchain_go getbalance -address 13Uu7B1vDP4ViXqHFsWtbraM3EfQ3UkWXt
Balance of <span class="hljs-string">&apos;13Uu7B1vDP4ViXqHFsWtbraM3EfQ3UkWXt&apos;</span>: 10

$ blockchain_go send -from 15pUhCbtrGh3JUx5iHnXjfpyHyTgawvG5h -to 13Uu7B1vDP4ViXqHFsWtbraM3EfQ3UkWXt -amount 5
2017/09/12 13:08:56 ERROR: Not enough funds

$ blockchain_go send -from 13Uu7B1vDP4ViXqHFsWtbraM3EfQ3UkWXt -to 15pUhCbtrGh3JUx5iHnXjfpyHyTgawvG5h -amount 6
00000019afa909094193f64ca06e9039849709f5948fbac56cae7b1b8f0ff162

Success!

$ blockchain_go getbalance -address 13Uu7B1vDP4ViXqHFsWtbraM3EfQ3UkWXt
Balance of <span class="hljs-string">&apos;13Uu7B1vDP4ViXqHFsWtbraM3EfQ3UkWXt&apos;</span>: 4

$ blockchain_go getbalance -address 15pUhCbtrGh3JUx5iHnXjfpyHyTgawvG5h
Balance of <span class="hljs-string">&apos;15pUhCbtrGh3JUx5iHnXjfpyHyTgawvG5h&apos;</span>: 6

$ blockchain_go getbalance -address 1Lhqun1E9zZZhodiTqxfPQBcwr1CVDV2sy
Balance of <span class="hljs-string">&apos;1Lhqun1E9zZZhodiTqxfPQBcwr1CVDV2sy&apos;</span>: 0
</code></pre>
<p>&#x5F88;&#x597D;&#xFF01;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x6765;&#x5B9E;&#x73B0;&#x4EA4;&#x6613;&#x7B7E;&#x540D;&#x3002;</p>
<h2 id="&#x5B9E;&#x73B0;&#x7B7E;&#x540D;">&#x5B9E;&#x73B0;&#x7B7E;&#x540D;</h2>
<p>&#x4EA4;&#x6613;&#x5FC5;&#x987B;&#x88AB;&#x7B7E;&#x540D;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x662F;&#x6BD4;&#x7279;&#x5E01;&#x91CC;&#x9762;&#x4FDD;&#x8BC1;&#x53D1;&#x9001;&#x65B9;&#x4E0D;&#x4F1A;&#x82B1;&#x8D39;&#x5C5E;&#x4E8E;&#x5176;&#x4ED6;&#x4EBA;&#x7684;&#x5E01;&#x7684;&#x552F;&#x4E00;&#x65B9;&#x5F0F;&#x3002;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x7B7E;&#x540D;&#x662F;&#x65E0;&#x6548;&#x7684;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x7B14;&#x4EA4;&#x6613;&#x5C31;&#x4F1A;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x65E0;&#x6548;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x8FD9;&#x7B14;&#x4EA4;&#x6613;&#x4E5F;&#x5C31;&#x65E0;&#x6CD5;&#x88AB;&#x52A0;&#x5230;&#x533A;&#x5757;&#x94FE;&#x4E2D;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x79BB;&#x5B9E;&#x73B0;&#x4EA4;&#x6613;&#x7B7E;&#x540D;&#x8FD8;&#x5DEE;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#xFF1A;&#x7528;&#x4E8E;&#x7B7E;&#x540D;&#x7684;&#x6570;&#x636E;&#x3002;&#x4E00;&#x7B14;&#x4EA4;&#x6613;&#x7684;&#x54EA;&#x4E9B;&#x90E8;&#x5206;&#x9700;&#x8981;&#x7B7E;&#x540D;&#xFF1F;&#x53C8;&#x6216;&#x8005;&#x8BF4;&#xFF0C;&#x8981;&#x5BF9;&#x5B8C;&#x6574;&#x7684;&#x4EA4;&#x6613;&#x8FDB;&#x884C;&#x7B7E;&#x540D;&#xFF1F;&#x9009;&#x62E9;&#x7B7E;&#x540D;&#x7684;&#x6570;&#x636E;&#x76F8;&#x5F53;&#x91CD;&#x8981;&#x3002;&#x56E0;&#x4E3A;&#x7528;&#x4E8E;&#x7B7E;&#x540D;&#x7684;&#x8FD9;&#x4E2A;&#x6570;&#x636E;&#xFF0C;&#x5FC5;&#x987B;&#x8981;&#x5305;&#x542B;&#x80FD;&#x591F;&#x552F;&#x4E00;&#x8BC6;&#x522B;&#x6570;&#x636E;&#x7684;&#x4FE1;&#x606F;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x4EC5;&#x4EC5;&#x5BF9;&#x8F93;&#x51FA;&#x503C;&#x8FDB;&#x884C;&#x7B7E;&#x540D;&#x5E76;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x610F;&#x4E49;&#xFF0C;&#x56E0;&#x4E3A;&#x7B7E;&#x540D;&#x4E0D;&#x4F1A;&#x8003;&#x8651;&#x53D1;&#x9001;&#x65B9;&#x548C;&#x63A5;&#x6536;&#x65B9;&#x3002;</p>
<p>&#x8003;&#x8651;&#x5230;&#x4EA4;&#x6613;&#x89E3;&#x9501;&#x7684;&#x662F;&#x4E4B;&#x524D;&#x7684;&#x8F93;&#x51FA;&#xFF0C;&#x7136;&#x540E;&#x91CD;&#x65B0;&#x5206;&#x914D;&#x91CC;&#x9762;&#x7684;&#x4EF7;&#x503C;&#xFF0C;&#x5E76;&#x9501;&#x5B9A;&#x65B0;&#x7684;&#x8F93;&#x51FA;&#xFF0C;&#x90A3;&#x4E48;&#x5FC5;&#x987B;&#x8981;&#x7B7E;&#x540D;&#x4EE5;&#x4E0B;&#x6570;&#x636E;&#xFF1A;</p>
<ol>
<li><p>&#x5B58;&#x50A8;&#x5728;&#x5DF2;&#x89E3;&#x9501;&#x8F93;&#x51FA;&#x7684;&#x516C;&#x94A5;&#x54C8;&#x5E0C;&#x3002;&#x5B83;&#x8BC6;&#x522B;&#x4E86;&#x4E00;&#x7B14;&#x4EA4;&#x6613;&#x7684;&#x201C;&#x53D1;&#x9001;&#x65B9;&#x201D;&#x3002;</p>
</li>
<li><p>&#x5B58;&#x50A8;&#x5728;&#x65B0;&#x7684;&#x9501;&#x5B9A;&#x8F93;&#x51FA;&#x91CC;&#x9762;&#x7684;&#x516C;&#x94A5;&#x54C8;&#x5E0C;&#x3002;&#x5B83;&#x8BC6;&#x522B;&#x4E86;&#x4E00;&#x7B14;&#x4EA4;&#x6613;&#x7684;&#x201C;&#x63A5;&#x6536;&#x65B9;&#x201D;&#x3002;</p>
</li>
<li><p>&#x65B0;&#x7684;&#x8F93;&#x51FA;&#x503C;&#x3002;</p>
</li>
</ol>
<blockquote>
<p>&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x4E2D;&#xFF0C;&#x9501;&#x5B9A;/&#x89E3;&#x9501;&#x903B;&#x8F91;&#x88AB;&#x5B58;&#x50A8;&#x5728;&#x811A;&#x672C;&#x4E2D;&#xFF0C;&#x5B83;&#x4EEC;&#x88AB;&#x5206;&#x522B;&#x5B58;&#x50A8;&#x5728;&#x8F93;&#x5165;&#x548C;&#x8F93;&#x51FA;&#x7684; <code>ScriptSig</code> &#x548C; <code>ScriptPubKey</code> &#x5B57;&#x6BB5;&#x3002;&#x7531;&#x4E8E;&#x6BD4;&#x7279;&#x5E01;&#x5141;&#x8BB8;&#x8FD9;&#x6837;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x811A;&#x672C;&#xFF0C;&#x5B83;&#x5BF9; <code>ScriptPubKey</code> &#x7684;&#x6574;&#x4E2A;&#x5185;&#x5BB9;&#x8FDB;&#x884C;&#x4E86;&#x7B7E;&#x540D;&#x3002;</p>
</blockquote>
<p>&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x9700;&#x8981;&#x5BF9;&#x5B58;&#x50A8;&#x5728;&#x8F93;&#x5165;&#x91CC;&#x9762;&#x7684;&#x516C;&#x94A5;&#x7B7E;&#x540D;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x91CC;&#xFF0C; &#x6240;&#x7B7E;&#x540D;&#x7684;&#x5E76;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x4EA4;&#x6613;&#xFF0C;&#x800C;&#x662F;&#x4E00;&#x4E2A;&#x53BB;&#x9664;&#x90E8;&#x5206;&#x5185;&#x5BB9;&#x7684;&#x8F93;&#x5165;&#x526F;&#x672C;&#xFF0C;&#x8F93;&#x5165;&#x91CC;&#x9762;&#x5B58;&#x50A8;&#x4E86;&#x88AB;&#x5F15;&#x7528;&#x8F93;&#x51FA;&#x7684; <code>ScriptPubKey</code> &#x3002;</p>
<blockquote>
<p>&#x83B7;&#x53D6;&#x4FEE;&#x526A;&#x540E;&#x7684;&#x4EA4;&#x6613;&#x526F;&#x672C;&#x7684;&#x8BE6;&#x7EC6;&#x8FC7;&#x7A0B;&#x5728;<a href="https://en.bitcoin.it/wiki/File:Bitcoin_OpCheckSig_InDetail.png" target="_blank">&#x8FD9;&#x91CC;</a>. &#x867D;&#x7136;&#x5B83;&#x53EF;&#x80FD;&#x5DF2;&#x7ECF;&#x8FC7;&#x65F6;&#x4E86;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x5E76;&#x6CA1;&#x6709;&#x627E;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x66F4;&#x53EF;&#x9760;&#x7684;&#x6765;&#x6E90;&#x3002;</p>
</blockquote>
<p>&#x770B;&#x7740;&#x6709;&#x70B9;&#x590D;&#x6742;&#xFF0C;&#x6765;&#x5F00;&#x59CB;&#x5199;&#x4EE3;&#x7801;&#x5427;&#x3002;&#x5148;&#x4ECE; <code>Sign</code> &#x65B9;&#x6CD5;&#x5F00;&#x59CB;&#xFF1A;</p>
<pre><code class="lang-go"><span class="hljs-keyword">func</span> (tx *Transaction) Sign(privKey ecdsa.PrivateKey, prevTXs <span class="hljs-keyword">map</span>[<span class="hljs-keyword">string</span>]Transaction) {
    <span class="hljs-keyword">if</span> tx.IsCoinbase() {
        <span class="hljs-keyword">return</span>
    }

    txCopy := tx.TrimmedCopy()

    <span class="hljs-keyword">for</span> inID, vin := <span class="hljs-keyword">range</span> txCopy.Vin {
        prevTx := prevTXs[hex.EncodeToString(vin.Txid)]
        txCopy.Vin[inID].Signature = <span class="hljs-literal">nil</span>
        txCopy.Vin[inID].PubKey = prevTx.Vout[vin.Vout].PubKeyHash
        txCopy.ID = txCopy.Hash()
        txCopy.Vin[inID].PubKey = <span class="hljs-literal">nil</span>

        r, s, err := ecdsa.Sign(rand.Reader, &amp;privKey, txCopy.ID)
        signature := <span class="hljs-built_in">append</span>(r.Bytes(), s.Bytes()...)

        tx.Vin[inID].Signature = signature
    }
}
</code></pre>
<p>&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x63A5;&#x53D7;&#x4E00;&#x4E2A;&#x79C1;&#x94A5;&#x548C;&#x4E00;&#x4E2A;&#x4E4B;&#x524D;&#x4EA4;&#x6613;&#x7684; map&#x3002;&#x6B63;&#x5982;&#x4E0A;&#x9762;&#x63D0;&#x5230;&#x7684;&#xFF0C;&#x4E3A;&#x4E86;&#x5BF9;&#x4E00;&#x7B14;&#x4EA4;&#x6613;&#x8FDB;&#x884C;&#x7B7E;&#x540D;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x83B7;&#x53D6;&#x4EA4;&#x6613;&#x8F93;&#x5165;&#x6240;&#x5F15;&#x7528;&#x7684;&#x8F93;&#x51FA;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5B58;&#x50A8;&#x8FD9;&#x4E9B;&#x8F93;&#x51FA;&#x7684;&#x4EA4;&#x6613;&#x3002;</p>
<p>&#x6765;&#x4E00;&#x6B65;&#x4E00;&#x6B65;&#x5730;&#x5206;&#x6790;&#x8BE5;&#x65B9;&#x6CD5;&#xFF1A;</p>
<pre><code class="lang-go"><span class="hljs-keyword">if</span> tx.IsCoinbase() {
    <span class="hljs-keyword">return</span>
}
</code></pre>
<p>coinbase &#x4EA4;&#x6613;&#x56E0;&#x4E3A;&#x6CA1;&#x6709;&#x5B9E;&#x9645;&#x8F93;&#x5165;&#xFF0C;&#x6240;&#x4EE5;&#x6CA1;&#x6709;&#x88AB;&#x7B7E;&#x540D;&#x3002;</p>
<pre><code class="lang-go">txCopy := tx.TrimmedCopy()
</code></pre>
<p>&#x5C06;&#x4F1A;&#x88AB;&#x7B7E;&#x7F72;&#x7684;&#x662F;&#x4FEE;&#x526A;&#x540E;&#x7684;&#x4EA4;&#x6613;&#x526F;&#x672C;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x4EA4;&#x6613;&#xFF1A;</p>
<pre><code class="lang-go"><span class="hljs-keyword">func</span> (tx *Transaction) TrimmedCopy() Transaction {
    <span class="hljs-keyword">var</span> inputs []TXInput
    <span class="hljs-keyword">var</span> outputs []TXOutput

    <span class="hljs-keyword">for</span> _, vin := <span class="hljs-keyword">range</span> tx.Vin {
        inputs = <span class="hljs-built_in">append</span>(inputs, TXInput{vin.Txid, vin.Vout, <span class="hljs-literal">nil</span>, <span class="hljs-literal">nil</span>})
    }

    <span class="hljs-keyword">for</span> _, vout := <span class="hljs-keyword">range</span> tx.Vout {
        outputs = <span class="hljs-built_in">append</span>(outputs, TXOutput{vout.Value, vout.PubKeyHash})
    }

    txCopy := Transaction{tx.ID, inputs, outputs}

    <span class="hljs-keyword">return</span> txCopy
}
</code></pre>
<p>&#x8FD9;&#x4E2A;&#x526F;&#x672C;&#x5305;&#x542B;&#x4E86;&#x6240;&#x6709;&#x7684;&#x8F93;&#x5165;&#x548C;&#x8F93;&#x51FA;&#xFF0C;&#x4F46;&#x662F; <code>TXInput.Signature</code> &#x548C; <code>TXIput.PubKey</code> &#x88AB;&#x8BBE;&#x7F6E;&#x4E3A; <code>nil</code>&#x3002;</p>
<p>&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x8FED;&#x4EE3;&#x526F;&#x672C;&#x4E2D;&#x6BCF;&#x4E00;&#x4E2A;&#x8F93;&#x5165;&#xFF1A;</p>
<pre><code class="lang-go"><span class="hljs-keyword">for</span> inID, vin := <span class="hljs-keyword">range</span> txCopy.Vin {
    prevTx := prevTXs[hex.EncodeToString(vin.Txid)]
    txCopy.Vin[inID].Signature = <span class="hljs-literal">nil</span>
    txCopy.Vin[inID].PubKey = prevTx.Vout[vin.Vout].PubKeyHash
</code></pre>
<p>&#x5728;&#x6BCF;&#x4E2A;&#x8F93;&#x5165;&#x4E2D;&#xFF0C;<code>Signature</code> &#x88AB;&#x8BBE;&#x7F6E;&#x4E3A; <code>nil</code> (&#x4EC5;&#x4EC5;&#x662F;&#x4E00;&#x4E2A;&#x53CC;&#x91CD;&#x68C0;&#x9A8C;)&#xFF0C;<code>PubKey</code> &#x88AB;&#x8BBE;&#x7F6E;&#x4E3A;&#x6240;&#x5F15;&#x7528;&#x8F93;&#x51FA;&#x7684; <code>PubKeyHash</code>&#x3002;&#x73B0;&#x5728;&#xFF0C;&#x9664;&#x4E86;&#x5F53;&#x524D;&#x4EA4;&#x6613;&#xFF0C;&#x5176;&#x4ED6;&#x6240;&#x6709;&#x4EA4;&#x6613;&#x90FD;&#x662F;&#x201C;&#x7A7A;&#x7684;&#x201D;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x4ED6;&#x4EEC;&#x7684; <code>Signature</code> &#x548C; <code>PubKey</code> &#x5B57;&#x6BB5;&#x88AB;&#x8BBE;&#x7F6E;&#x4E3A; <code>nil</code>&#x3002;&#x56E0;&#x6B64;&#xFF0C;<strong>&#x8F93;&#x5165;&#x662F;&#x88AB;&#x5206;&#x5F00;&#x7B7E;&#x540D;&#x7684;</strong>&#xFF0C;&#x5C3D;&#x7BA1;&#x8FD9;&#x5BF9;&#x4E8E;&#x6211;&#x4EEC;&#x7684;&#x5E94;&#x7528;&#x5E76;&#x4E0D;&#x5341;&#x5206;&#x7D27;&#x8981;&#xFF0C;&#x4F46;&#x662F;&#x6BD4;&#x7279;&#x5E01;&#x5141;&#x8BB8;&#x4EA4;&#x6613;&#x5305;&#x542B;&#x5F15;&#x7528;&#x4E86;&#x4E0D;&#x540C;&#x5730;&#x5740;&#x7684;&#x8F93;&#x5165;&#x3002;</p>
<pre><code class="lang-go">    txCopy.ID = txCopy.Hash()
    txCopy.Vin[inID].PubKey = <span class="hljs-literal">nil</span>
</code></pre>
<p><code>Hash</code> &#x65B9;&#x6CD5;&#x5BF9;&#x4EA4;&#x6613;&#x8FDB;&#x884C;&#x5E8F;&#x5217;&#x5316;&#xFF0C;&#x5E76;&#x4F7F;&#x7528; SHA-256 &#x7B97;&#x6CD5;&#x8FDB;&#x884C;&#x54C8;&#x5E0C;&#x3002;&#x54C8;&#x5E0C;&#x540E;&#x7684;&#x7ED3;&#x679C;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x8981;&#x7B7E;&#x540D;&#x7684;&#x6570;&#x636E;&#x3002;&#x5728;&#x83B7;&#x53D6;&#x5B8C;&#x54C8;&#x5E0C;&#xFF0C;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x91CD;&#x7F6E; <code>PubKey</code> &#x5B57;&#x6BB5;&#xFF0C;&#x4EE5;&#x4FBF;&#x4E8E;&#x5B83;&#x4E0D;&#x4F1A;&#x5F71;&#x54CD;&#x540E;&#x9762;&#x7684;&#x8FED;&#x4EE3;&#x3002;</p>
<p>&#x73B0;&#x5728;&#xFF0C;&#x5173;&#x952E;&#x70B9;&#xFF1A;</p>
<pre><code class="lang-go">    r, s, err := ecdsa.Sign(rand.Reader, &amp;privKey, txCopy.ID)
    signature := <span class="hljs-built_in">append</span>(r.Bytes(), s.Bytes()...)

    tx.Vin[inID].Signature = signature
</code></pre>
<p>&#x6211;&#x4EEC;&#x901A;&#x8FC7; <code>privKey</code> &#x5BF9; <code>txCopy.ID</code> &#x8FDB;&#x884C;&#x7B7E;&#x540D;&#x3002;&#x4E00;&#x4E2A; ECDSA &#x7B7E;&#x540D;&#x5C31;&#x662F;&#x4E00;&#x5BF9;&#x6570;&#x5B57;&#xFF0C;&#x6211;&#x4EEC;&#x5BF9;&#x8FD9;&#x5BF9;&#x6570;&#x5B57;&#x8FDE;&#x63A5;&#x8D77;&#x6765;&#xFF0C;&#x5E76;&#x5B58;&#x50A8;&#x5728;&#x8F93;&#x5165;&#x7684; <code>Signature</code> &#x5B57;&#x6BB5;&#x3002;</p>
<p>&#x73B0;&#x5728;&#xFF0C;&#x9A8C;&#x8BC1;&#x51FD;&#x6570;&#xFF1A;</p>
<pre><code class="lang-go"><span class="hljs-keyword">func</span> (tx *Transaction) Verify(prevTXs <span class="hljs-keyword">map</span>[<span class="hljs-keyword">string</span>]Transaction) <span class="hljs-keyword">bool</span> {
    txCopy := tx.TrimmedCopy()
    curve := elliptic.P256()

    <span class="hljs-keyword">for</span> inID, vin := <span class="hljs-keyword">range</span> tx.Vin {
        prevTx := prevTXs[hex.EncodeToString(vin.Txid)]
        txCopy.Vin[inID].Signature = <span class="hljs-literal">nil</span>
        txCopy.Vin[inID].PubKey = prevTx.Vout[vin.Vout].PubKeyHash
        txCopy.ID = txCopy.Hash()
        txCopy.Vin[inID].PubKey = <span class="hljs-literal">nil</span>

        r := big.Int{}
        s := big.Int{}
        sigLen := <span class="hljs-built_in">len</span>(vin.Signature)
        r.SetBytes(vin.Signature[:(sigLen / <span class="hljs-number">2</span>)])
        s.SetBytes(vin.Signature[(sigLen / <span class="hljs-number">2</span>):])

        x := big.Int{}
        y := big.Int{}
        keyLen := <span class="hljs-built_in">len</span>(vin.PubKey)
        x.SetBytes(vin.PubKey[:(keyLen / <span class="hljs-number">2</span>)])
        y.SetBytes(vin.PubKey[(keyLen / <span class="hljs-number">2</span>):])

        rawPubKey := ecdsa.PublicKey{curve, &amp;x, &amp;y}
        <span class="hljs-keyword">if</span> ecdsa.Verify(&amp;rawPubKey, txCopy.ID, &amp;r, &amp;s) == <span class="hljs-literal">false</span> {
            <span class="hljs-keyword">return</span> <span class="hljs-literal">false</span>
        }
    }

    <span class="hljs-keyword">return</span> <span class="hljs-literal">true</span>
}
</code></pre>
<p>&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x5341;&#x5206;&#x76F4;&#x89C2;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x540C;&#x4E00;&#x7B14;&#x4EA4;&#x6613;&#x7684;&#x526F;&#x672C;&#xFF1A;</p>
<pre><code class="lang-go">txCopy := tx.TrimmedCopy()
</code></pre>
<p>&#x7136;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x76F8;&#x540C;&#x7684;&#x533A;&#x5757;&#x7528;&#x4E8E;&#x751F;&#x6210;&#x5BC6;&#x94A5;&#x5BF9;&#xFF1A;</p>
<pre><code class="lang-go">curve := elliptic.P256()
</code></pre>
<p>&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x6211;&#x4EEC;&#x68C0;&#x67E5;&#x6BCF;&#x4E2A;&#x8F93;&#x5165;&#x4E2D;&#x7684;&#x7B7E;&#x540D;&#xFF1A;</p>
<pre><code class="lang-go"><span class="hljs-keyword">for</span> inID, vin := <span class="hljs-keyword">range</span> tx.Vin {
    prevTx := prevTXs[hex.EncodeToString(vin.Txid)]
    txCopy.Vin[inID].Signature = <span class="hljs-literal">nil</span>
    txCopy.Vin[inID].PubKey = prevTx.Vout[vin.Vout].PubKeyHash
    txCopy.ID = txCopy.Hash()
    txCopy.Vin[inID].PubKey = <span class="hljs-literal">nil</span>
</code></pre>
<p>&#x8FD9;&#x4E2A;&#x90E8;&#x5206;&#x8DDF; <code>Sign</code> &#x65B9;&#x6CD5;&#x4E00;&#x6A21;&#x4E00;&#x6837;&#xFF0C;&#x56E0;&#x4E3A;&#x5728;&#x9A8C;&#x8BC1;&#x9636;&#x6BB5;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x7684;&#x662F;&#x4E0E;&#x7B7E;&#x540D;&#x76F8;&#x540C;&#x7684;&#x6570;&#x636E;&#x3002;</p>
<pre><code class="lang-go">    r := big.Int{}
    s := big.Int{}
    sigLen := <span class="hljs-built_in">len</span>(vin.Signature)
    r.SetBytes(vin.Signature[:(sigLen / <span class="hljs-number">2</span>)])
    s.SetBytes(vin.Signature[(sigLen / <span class="hljs-number">2</span>):])

    x := big.Int{}
    y := big.Int{}
    keyLen := <span class="hljs-built_in">len</span>(vin.PubKey)
    x.SetBytes(vin.PubKey[:(keyLen / <span class="hljs-number">2</span>)])
    y.SetBytes(vin.PubKey[(keyLen / <span class="hljs-number">2</span>):])
</code></pre>
<p>&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x89E3;&#x5305;&#x5B58;&#x50A8;&#x5728; <code>TXInput.Signature</code> &#x548C; <code>TXInput.PubKey</code> &#x4E2D;&#x7684;&#x503C;&#xFF0C;&#x56E0;&#x4E3A;&#x4E00;&#x4E2A;&#x7B7E;&#x540D;&#x5C31;&#x662F;&#x4E00;&#x5BF9;&#x6570;&#x5B57;&#xFF0C;&#x4E00;&#x4E2A;&#x516C;&#x94A5;&#x5C31;&#x662F;&#x4E00;&#x5BF9;&#x5750;&#x6807;&#x3002;&#x6211;&#x4EEC;&#x4E4B;&#x524D;&#x4E3A;&#x4E86;&#x5B58;&#x50A8;&#x5C06;&#x5B83;&#x4EEC;&#x8FDE;&#x63A5;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5BF9;&#x5B83;&#x4EEC;&#x8FDB;&#x884C;&#x89E3;&#x5305;&#x5728; <code>crypto/ecdsa</code> &#x51FD;&#x6570;&#x4E2D;&#x4F7F;&#x7528;&#x3002;</p>
<pre><code class="lang-go">    rawPubKey := ecdsa.PublicKey{curve, &amp;x, &amp;y}
    <span class="hljs-keyword">if</span> ecdsa.Verify(&amp;rawPubKey, txCopy.ID, &amp;r, &amp;s) == <span class="hljs-literal">false</span> {
        <span class="hljs-keyword">return</span> <span class="hljs-literal">false</span>
    }
}

<span class="hljs-keyword">return</span> <span class="hljs-literal">true</span>
</code></pre>
<p>&#x5728;&#x8FD9;&#x91CC;&#xFF1A;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x4ECE;&#x8F93;&#x5165;&#x63D0;&#x53D6;&#x7684;&#x516C;&#x94A5;&#x521B;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A; <code>ecdsa.PublicKey</code>&#xFF0C;&#x901A;&#x8FC7;&#x4F20;&#x5165;&#x8F93;&#x5165;&#x4E2D;&#x63D0;&#x53D6;&#x7684;&#x7B7E;&#x540D;&#x6267;&#x884C;&#x4E86; <code>ecdsa.Verify</code>&#x3002;&#x5982;&#x679C;&#x6240;&#x6709;&#x7684;&#x8F93;&#x5165;&#x90FD;&#x88AB;&#x9A8C;&#x8BC1;&#xFF0C;&#x8FD4;&#x56DE; <code>true</code>&#xFF1B;&#x5982;&#x679C;&#x6709;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x9A8C;&#x8BC1;&#x5931;&#x8D25;&#xFF0C;&#x8FD4;&#x56DE; <code>false</code>.</p>
<p>&#x73B0;&#x5728;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x6765;&#x83B7;&#x5F97;&#x4E4B;&#x524D;&#x7684;&#x4EA4;&#x6613;&#x3002;&#x7531;&#x4E8E;&#x8FD9;&#x9700;&#x8981;&#x4E0E;&#x533A;&#x5757;&#x94FE;&#x8FDB;&#x884C;&#x4EA4;&#x4E92;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x5B83;&#x653E;&#x5728;&#x4E86; <code>Blockchain</code> &#x7684;&#x65B9;&#x6CD5;&#x91CC;&#x9762;&#xFF1A;</p>
<pre><code class="lang-go"><span class="hljs-keyword">func</span> (bc *Blockchain) FindTransaction(ID []<span class="hljs-keyword">byte</span>) (Transaction, error) {
    bci := bc.Iterator()

    <span class="hljs-keyword">for</span> {
        block := bci.Next()

        <span class="hljs-keyword">for</span> _, tx := <span class="hljs-keyword">range</span> block.Transactions {
            <span class="hljs-keyword">if</span> bytes.Compare(tx.ID, ID) == <span class="hljs-number">0</span> {
                <span class="hljs-keyword">return</span> *tx, <span class="hljs-literal">nil</span>
            }
        }

        <span class="hljs-keyword">if</span> <span class="hljs-built_in">len</span>(block.PrevBlockHash) == <span class="hljs-number">0</span> {
            <span class="hljs-keyword">break</span>
        }
    }

    <span class="hljs-keyword">return</span> Transaction{}, errors.New(<span class="hljs-string">&quot;Transaction is not found&quot;</span>)
}

<span class="hljs-keyword">func</span> (bc *Blockchain) SignTransaction(tx *Transaction, privKey ecdsa.PrivateKey) {
    prevTXs := <span class="hljs-built_in">make</span>(<span class="hljs-keyword">map</span>[<span class="hljs-keyword">string</span>]Transaction)

    <span class="hljs-keyword">for</span> _, vin := <span class="hljs-keyword">range</span> tx.Vin {
        prevTX, err := bc.FindTransaction(vin.Txid)
        prevTXs[hex.EncodeToString(prevTX.ID)] = prevTX
    }

    tx.Sign(privKey, prevTXs)
}

<span class="hljs-keyword">func</span> (bc *Blockchain) VerifyTransaction(tx *Transaction) <span class="hljs-keyword">bool</span> {
    prevTXs := <span class="hljs-built_in">make</span>(<span class="hljs-keyword">map</span>[<span class="hljs-keyword">string</span>]Transaction)

    <span class="hljs-keyword">for</span> _, vin := <span class="hljs-keyword">range</span> tx.Vin {
        prevTX, err := bc.FindTransaction(vin.Txid)
        prevTXs[hex.EncodeToString(prevTX.ID)] = prevTX
    }

    <span class="hljs-keyword">return</span> tx.Verify(prevTXs)
}
</code></pre>
<p>&#x8FD9;&#x51E0;&#x4E2A;&#x6BD4;&#x8F83;&#x7B80;&#x5355;&#xFF1A;<code>FindTransaction</code> &#x901A;&#x8FC7; ID &#x627E;&#x5230;&#x4E00;&#x7B14;&#x4EA4;&#x6613;&#xFF08;&#x8FD9;&#x9700;&#x8981;&#x5728;&#x533A;&#x5757;&#x94FE;&#x4E0A;&#x8FED;&#x4EE3;&#x6240;&#x6709;&#x533A;&#x5757;&#xFF09;&#xFF1B;<code>SignTransaction</code> &#x4F20;&#x5165;&#x4E00;&#x7B14;&#x4EA4;&#x6613;&#xFF0C;&#x627E;&#x5230;&#x5B83;&#x5F15;&#x7528;&#x7684;&#x4EA4;&#x6613;&#xFF0C;&#x7136;&#x540E;&#x5BF9;&#x5B83;&#x8FDB;&#x884C;&#x7B7E;&#x540D;&#xFF1B;<code>VerifyTransaction</code> &#x505A;&#x7684;&#x662F;&#x76F8;&#x540C;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x4E0D;&#x8FC7;&#x662F;&#x5BF9;&#x4EA4;&#x6613;&#x8FDB;&#x884C;&#x9A8C;&#x8BC1;&#x3002;</p>
<p>&#x73B0;&#x5728;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5B9E;&#x9645;&#x7B7E;&#x540D;&#x548C;&#x9A8C;&#x8BC1;&#x4EA4;&#x6613;&#x3002;&#x7B7E;&#x540D;&#x5728; <code>NewUTXOTransaction</code> &#x4E2D;&#x8FDB;&#x884C;&#xFF1A;</p>
<pre><code class="lang-go"><span class="hljs-keyword">func</span> NewUTXOTransaction(from, to <span class="hljs-keyword">string</span>, amount <span class="hljs-keyword">int</span>, bc *Blockchain) *Transaction {
    ...

    tx := Transaction{<span class="hljs-literal">nil</span>, inputs, outputs}
    tx.ID = tx.Hash()
    bc.SignTransaction(&amp;tx, wallet.PrivateKey)

    <span class="hljs-keyword">return</span> &amp;tx
}
</code></pre>
<p>&#x5728;&#x4E00;&#x7B14;&#x4EA4;&#x6613;&#x88AB;&#x653E;&#x5165;&#x4E00;&#x4E2A;&#x5757;&#x4E4B;&#x524D;&#x8FDB;&#x884C;&#x9A8C;&#x8BC1;&#xFF1A;</p>
<pre><code class="lang-go"><span class="hljs-keyword">func</span> (bc *Blockchain) MineBlock(transactions []*Transaction) {
    <span class="hljs-keyword">var</span> lastHash []<span class="hljs-keyword">byte</span>

    <span class="hljs-keyword">for</span> _, tx := <span class="hljs-keyword">range</span> transactions {
        <span class="hljs-keyword">if</span> bc.VerifyTransaction(tx) != <span class="hljs-literal">true</span> {
            log.Panic(<span class="hljs-string">&quot;ERROR: Invalid transaction&quot;</span>)
        }
    }
    ...
}
</code></pre>
<p>&#x5C31;&#x662F;&#x8FD9;&#x4E9B;&#x4E86;&#xFF01;&#x8BA9;&#x6211;&#x4EEC;&#x518D;&#x6765;&#x68C0;&#x67E5;&#x4E00;&#x4E0B;&#x6240;&#x6709;&#x5185;&#x5BB9;&#xFF1A;</p>
<pre><code class="lang-go">$ blockchain_go createwallet
Your <span class="hljs-built_in">new</span> address: <span class="hljs-number">1</span>AmVdDvvQ977oVCpUqz7zAPUEiXKrX5avR

$ blockchain_go createwallet
Your <span class="hljs-built_in">new</span> address: <span class="hljs-number">1</span>NE86r4Esjf53EL7fR86CsfTZpNN42Sfab

$ blockchain_go createblockchain -address <span class="hljs-number">1</span>AmVdDvvQ977oVCpUqz7zAPUEiXKrX5avR
<span class="hljs-number">000000122348d</span>a06c19e5c513710340f4c307d884385da948a205655c6a9d008

Done!

$ blockchain_go send -from <span class="hljs-number">1</span>AmVdDvvQ977oVCpUqz7zAPUEiXKrX5avR -to <span class="hljs-number">1</span>NE86r4Esjf53EL7fR86CsfTZpNN42Sfab -amount <span class="hljs-number">6</span>
<span class="hljs-number">0000000f</span>3dbb0ab6d56c4e4b9f7479afe8d5a5dad4d2a8823345a1a16cf3347b

Success!

$ blockchain_go getbalance -address <span class="hljs-number">1</span>AmVdDvvQ977oVCpUqz7zAPUEiXKrX5avR
Balance of <span class="hljs-string">&apos;1AmVdDvvQ977oVCpUqz7zAPUEiXKrX5avR&apos;</span>: <span class="hljs-number">4</span>

$ blockchain_go getbalance -address <span class="hljs-number">1</span>NE86r4Esjf53EL7fR86CsfTZpNN42Sfab
Balance of <span class="hljs-string">&apos;1NE86r4Esjf53EL7fR86CsfTZpNN42Sfab&apos;</span>: <span class="hljs-number">6</span>
</code></pre>
<p>&#x4E00;&#x5207;&#x6B63;&#x5E38;&#xFF01;</p>
<p>&#x73B0;&#x5728;&#x6765;&#x6CE8;&#x91CA;&#x6389; <code>NewUTXOTransaction</code> &#x91CC;&#x9762;&#x7684;<code>bc.SignTransaction(&amp;tx, wallet.PrivateKey)</code> &#x7684;&#x8C03;&#x7528;&#xFF0C;&#x56E0;&#x4E3A;&#x672A;&#x7B7E;&#x540D;&#x7684;&#x4EA4;&#x6613;&#x65E0;&#x6CD5;&#x88AB;&#x6253;&#x5305;&#xFF1A;</p>
<pre><code class="lang-go"><span class="hljs-keyword">func</span> NewUTXOTransaction(from, to <span class="hljs-keyword">string</span>, amount <span class="hljs-keyword">int</span>, bc *Blockchain) *Transaction {
   ...
    tx := Transaction{<span class="hljs-literal">nil</span>, inputs, outputs}
    tx.ID = tx.Hash()
    <span class="hljs-comment">// bc.SignTransaction(&amp;tx, wallet.PrivateKey)</span>

    <span class="hljs-keyword">return</span> &amp;tx
}
</code></pre>
<pre><code class="lang-bash">$ go install
$ blockchain_go send -from 1AmVdDvvQ977oVCpUqz7zAPUEiXKrX5avR -to 1NE86r4Esjf53EL7fR86CsfTZpNN42Sfab -amount 1
2017/09/12 16:28:15 ERROR: Invalid transaction
</code></pre>
<p>&#x53C2;&#x8003;&#xFF1A;</p>
<p>[1] <a href="https://github.com/Jeiwan/blockchain_go/tree/part_5" target="_blank">Full source codes</a></p>
<p>[2] <a href="https://en.wikipedia.org/wiki/Public-key_cryptography" target="_blank">Public-key cryptography</a></p>
<p>[3] <a href="https://en.wikipedia.org/wiki/Digital_signature" target="_blank">Digital signatures</a></p>
<p>[4] <a href="https://en.wikipedia.org/wiki/Elliptic_curve" target="_blank">Elliptic curve</a></p>
<p>[5] <a href="https://en.wikipedia.org/wiki/Elliptic_curve_cryptography" target="_blank">Elliptic curve cryptography</a></p>
<p>[6] <a href="https://en.wikipedia.org/wiki/Elliptic_Curve_Digital_Signature_Algorithm" target="_blank">ECDSA</a></p>
<p>[7] <a href="https://en.bitcoin.it/wiki/Technical_background_of_version_1_Bitcoin_addresses" target="_blank">Technical background of Bitcoin addresses</a></p>
<p>[8] <a href="https://en.bitcoin.it/wiki/Address" target="_blank">Address</a></p>
<p>[9] <a href="https://en.bitcoin.it/wiki/Base58Check_encoding" target="_blank">Base58</a></p>
<p>[10] <a href="http://andrea.corbellini.name/2015/05/17/elliptic-curve-cryptography-a-gentle-introduction/" target="_blank">A gentle introduction to elliptic curve cryptography</a></p>
<p>[11] <a href="https://jeiwan.cc/posts/building-blockchain-in-go-part-5/" target="_blank">Building Blockchain in Go. Part 5: Addresses</a></p>
<hr>
<h2 id="&#x79C1;&#x94A5;&#x548C;&#x516C;&#x94A5;">&#x79C1;&#x94A5;&#x548C;&#x516C;&#x94A5;</h2>
<p>ECDSA(Elliptic Curve Digital Signature Algorithm)&#xFF0C;&#x692D;&#x5706;&#x66F2;&#x7EBF;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x7B97;&#x6CD5;&#x5C06;&#x7B7E;&#x540D;&#x4E0E;&#x9A8C;&#x8BC1;&#x8FDB;&#x884C;&#x4E86;&#x5206;&#x79BB;&#x3002;</p>
<p>$$
y^2 = x^3 + ax + b</p>
<p>$$</p>
<p>&#x5F02;&#x70B9;&#x76F8;&#x52A0;&#x548C;&#x540C;&#x70B9;&#x52A0;&#x500D;</p>
<p><a href="https://mp.weixin.qq.com/s/MigSmfzRfyw-ux1lm0iBhw" target="_blank">&#x6BD4;&#x7279;&#x5E01;&#x80CC;&#x540E;&#x7684;&#x6570;&#x5B66;</a></p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="../part-4/transactions-1.html" class="navigation navigation-prev " aria-label="Previous page: 交易（1）">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="../part-6/transactions-2.html" class="navigation navigation-next " aria-label="Next page: 交易（2）">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"地址","level":"2.5","depth":1,"next":{"title":"交易（2）","level":"2.6","depth":1,"path":"part-6/transactions-2.md","ref":"part-6/transactions-2.md","articles":[]},"previous":{"title":"交易（1）","level":"2.4","depth":1,"path":"part-4/transactions-1.md","ref":"part-4/transactions-1.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"part-5/address.md","mtime":"2018-08-17T11:16:46.000Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-08-21T04:33:47.527Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

