
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>PoW 本质上是个去中心化的时钟 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="../misc/dpos-consensus-algorithm-this-missing-white-paper.html" />
    
    
    <link rel="prev" href="../misc/the-blockchain-economy-a-beginners-guide-to-institutional-cryptoeconomics.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    前言
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">Bitcoin</li>
        
        
    
        <li class="chapter " data-level="2.1" data-path="../part-1/basic-prototype.html">
            
                <a href="../part-1/basic-prototype.html">
            
                    
                    基本原型
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2" data-path="../part-2/proof-of-work.html">
            
                <a href="../part-2/proof-of-work.html">
            
                    
                    工作量证明
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.3" data-path="../part-3/persistence-and-cli.html">
            
                <a href="../part-3/persistence-and-cli.html">
            
                    
                    持久化和命令行接口
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.4" data-path="../part-4/transactions-1.html">
            
                <a href="../part-4/transactions-1.html">
            
                    
                    交易（1）
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.5" data-path="../part-5/address.html">
            
                <a href="../part-5/address.html">
            
                    
                    地址
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.6" data-path="../part-6/transactions-2.html">
            
                <a href="../part-6/transactions-2.html">
            
                    
                    交易（2）
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.7" data-path="../part-7/network.html">
            
                <a href="../part-7/network.html">
            
                    
                    网络
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">Ethereum</li>
        
        
    
        <li class="chapter " data-level="3.1" data-path="../ethereum/design-rationale.html">
            
                <a href="../ethereum/design-rationale.html">
            
                    
                    设计原理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.2" data-path="../ethereum/ethereum-sharding-overview-and-finality.html">
            
                <a href="../ethereum/ethereum-sharding-overview-and-finality.html">
            
                    
                    以太坊分片：overview and finality
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.3" data-path="../ethereum/ethereum-casper-101.html">
            
                <a href="../ethereum/ethereum-casper-101.html">
            
                    
                    以太坊 Casper 101
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.4" data-path="../ethereum/ethereum-casper-101-glossary.html">
            
                <a href="../ethereum/ethereum-casper-101-glossary.html">
            
                    
                    以太坊 Casper 101 词汇表
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">Cardano</li>
        
        
    
        <li class="chapter " data-level="4.1" data-path="../cardano/cardano-introduction.html">
            
                <a href="../cardano/cardano-introduction.html">
            
                    
                    卡尔达诺入门必备
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.2" data-path="../cardano/ouroboros.html">
            
                <a href="../cardano/ouroboros.html">
            
                    
                    ouroboros
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">Menero</li>
        
        
    
        <li class="chapter " data-level="5.1" data-path="../monero/what-is-monero.html">
            
                <a href="../monero/what-is-monero.html">
            
                    
                    什么是门罗币？终极入门指南
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">IOTA</li>
        
        
    
        <li class="chapter " data-level="6.1" data-path="../iota/iota_consensus_v1.0.html">
            
                <a href="../iota/iota_consensus_v1.0.html">
            
                    
                    IOTA 交易，确认和共识
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">Misc</li>
        
        
    
        <li class="chapter " data-level="7.1" data-path="../misc/blockchain-consensus.html">
            
                <a href="../misc/blockchain-consensus.html">
            
                    
                    区块链共识
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="7.2" data-path="../misc/the-blockchain-economy-a-beginners-guide-to-institutional-cryptoeconomics.html">
            
                <a href="../misc/the-blockchain-economy-a-beginners-guide-to-institutional-cryptoeconomics.html">
            
                    
                    区块链经济学：制度加密经济学入门指南
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="7.3" data-path="explain-pow.html">
            
                <a href="explain-pow.html">
            
                    
                    PoW 本质上是个去中心化的时钟
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="7.4" data-path="../misc/dpos-consensus-algorithm-this-missing-white-paper.html">
            
                <a href="../misc/dpos-consensus-algorithm-this-missing-white-paper.html">
            
                    
                    DPOS 共识算法 - 缺失的白皮书
            
                </a>
            

            
        </li>
    

    
        
        <li class="divider"></li>
        
        
    
        <li class="chapter " data-level="8.1" data-path="../acknowledgement.html">
            
                <a href="../acknowledgement.html">
            
                    
                    致谢
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >PoW 本质上是个去中心化的时钟</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="pow-&#x672C;&#x8D28;&#x4E0A;&#x662F;&#x4E2A;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x7684;&#x65F6;&#x949F;">PoW &#x672C;&#x8D28;&#x4E0A;&#x662F;&#x4E2A;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x7684;&#x65F6;&#x949F;</h1>
<blockquote>
<p>&#x539F;&#x6587;&#xFF1A;<a href="https://grisha.org/blog/2018/01/23/explaining-proof-of-work/" target="_blank">Blockchain Proof-of-Work Is a Decentralized Clock</a></p>
<p>&#x539F;&#x6587;&#x4ECE;&#x533A;&#x5757;&#x94FE;&#x5982;&#x4F55;&#x4FDD;&#x6301;&#x4EA4;&#x6613;&#x6709;&#x5E8F;&#x7684;&#x57FA;&#x672C;&#x95EE;&#x9898;&#x51FA;&#x53D1;&#xFF0C;&#x5BF9;&#x8BE5;&#x95EE;&#x9898;&#x8FDB;&#x884C;&#x4E86;&#x8BE6;&#x7EC6;&#x9610;&#x8FF0;&#xFF0C;&#x5E76;&#x63D0;&#x51FA; PoW &#x672C;&#x8D28;&#x4E0A;&#x662F;&#x5B9E;&#x73B0;&#x4E86;&#x4E00;&#x4E2A;&#x201C;&#x65F6;&#x949F;&#x201D;&#x7684;&#x89C2;&#x70B9;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x949F;&#x7684;&#x4E00;&#x4E2A;&#x6EF4;&#x7B54;&#x5BF9;&#x5E94;&#x7684;&#x5C31;&#x662F; PoW &#x7B97;&#x51FA;&#x4E00;&#x6B21;&#x7684;&#x89E3;&#x3002;</p>
</blockquote>
<p>&#x672C;&#x6587;&#x89E3;&#x91CA;&#x4E86;&#x6BD4;&#x7279;&#x5E01; PoW&#xFF08;Proof-of-Work, &#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#xFF09; &#x7684;&#x5173;&#x952E;&#x8981;&#x7D20;&#xFF0C;&#x5C24;&#x5176;&#x5BF9; PoW &#x6765;&#x8BF4;&#x4E0D;&#x53EF;&#x6216;&#x7F3A;&#x7684;&#x4E00;&#x4E2A;&#x7279;&#x6027;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x8868;&#x660E;&#x5173;&#x4E8E; PoW &#x7ECF;&#x5E38;&#x8C08;&#x5230;&#x7684;&#x4E00;&#x4E9B;&#x5176;&#x4ED6;&#x7279;&#x6027;&#x5176;&#x5B9E;&#x662F;&#x6B21;&#x8981;&#x4F5C;&#x7528;&#xFF0C;&#x6BD4;&#x5982;&#x5B89;&#x5168;&#x6027;&#xFF0C;&#x8FD9;&#x4E9B;&#x6B21;&#x8981;&#x6548;&#x5E94;&#x6709;&#x7528;&#xFF0C;&#x4F46;&#x662F;&#x975E;&#x5FC5;&#x8981;&#x3002;</p>
<p>&#x8981;&#x60F3;&#x7406;&#x89E3;&#x672C;&#x6587;&#xFF0C;&#x9996;&#x5148;&#x8981;&#x61C2;&#x5F97;&#x5728;&#x533A;&#x5757;&#x94FE;&#x4E2D;&#xFF0C;PoW &#x662F;&#x5982;&#x4F55;&#x5DE5;&#x4F5C;&#x7684;&#x4E00;&#x4E9B;&#x6709;&#x8DA3;&#x7684;&#x5C5E;&#x6027;&#xFF0C;&#x8FD9;&#x4E9B;&#x5C5E;&#x6027;&#x5E76;&#x4E0D;&#x90A3;&#x4E48;&#x76F4;&#x89C2;&#xFF0C;&#x751A;&#x81F3;&#x53EF;&#x4EE5;&#x8BF4;&#x76F8;&#x5F53;&#x53CD;&#x76F4;&#x89C9;&#xFF0C;&#x6BD4;&#x5982;&#x53C2;&#x4E0E;&#x8005;&#x5982;&#x4F55;&#x5728;<em>&#x4ECE;&#x6765;&#x6CA1;&#x6709;&#x76F8;&#x4E92;&#x4EA4;&#x6D41;</em>&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5171;&#x540C;&#x5730;&#x6C42;&#x89E3;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x5F53;&#x7406;&#x89E3;&#x4E86;&#x8FD9;&#x4E9B;&#x5C5E;&#x6027;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x80FD;&#x591F;&#x5F97;&#x51FA;&#x4E00;&#x4E2A;&#x7ED3;&#x8BBA;&#xFF1A;PoW &#x7684;&#x673A;&#x5236;&#x4E3B;&#x8981;&#x5B9E;&#x73B0;&#x4E86;&#x4E00;&#x4E2A;&#x5206;&#x5E03;&#x5F0F;&#xFF0C;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x7684;&#x65F6;&#x95F4;&#x7CFB;&#x7EDF;&#xFF0C;&#x5373;&#x4E00;&#x4E2A;&#x65F6;&#x949F;&#x3002;</p>
<p>&#x6CE8;&#x610F;&#x672C;&#x6587;&#x5E76;&#x975E;&#x5173;&#x6CE8; PoW &#x7B97;&#x6CD5;&#x672C;&#x8EAB;&#x7684;&#x7EC6;&#x8282;&#xFF0C;&#x800C;&#x662F;&#x63A2;&#x7A76;&#x533A;&#x5757;&#x94FE;&#x5982;&#x4F55;&#x201C;&#x4E25;&#x4E1D;&#x5408;&#x7F1D;&#x201D;&#x5730;&#x5C06; PoW &#x8FD0;&#x7528;&#x5176;&#x4E2D;&#x3002;&#x5982;&#x679C;&#x4F60;&#x8FD8;&#x6CA1;&#x542C;&#x8FC7; PoW&#xFF0C;&#x8BF7;&#x5148;&#x9605;&#x8BFB; <a href="https://en.bitcoin.it/wiki/Proof_of_work" target="_blank">&#x8FD9;&#x91CC;</a>&#x3002;</p>
<h2 id="&#x5206;&#x5E03;&#x5F0F;&#x8D26;&#x672C;&#x65F6;&#x95F4;&#x6392;&#x5E8F;&#x95EE;&#x9898;">&#x5206;&#x5E03;&#x5F0F;&#x8D26;&#x672C;&#x65F6;&#x95F4;&#x6392;&#x5E8F;&#x95EE;&#x9898;</h2>
<p>&#x5728;&#x8BB2;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x4E4B;&#x524D;&#xFF0C;&#x5148;&#x6765;&#x5173;&#x6CE8;&#x95EE;&#x9898;&#x672C;&#x8EAB;&#x3002;&#x5F88;&#x591A; PoW &#x7684;&#x76F8;&#x5173;&#x8D44;&#x6599;&#x90FD;&#x5F88;&#x4EE4;&#x4EBA;&#x8D39;&#x89E3;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x5E38;&#x5E38;&#x5728;&#x6CA1;&#x6709;&#x9610;&#x660E;&#x95EE;&#x9898;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5C31;&#x8BD5;&#x56FE;&#x8BB2;&#x6E05;&#x695A;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;</p>
<p>&#x6BEB;&#x65E0;&#x7591;&#x95EE;&#xFF0C;&#x4EFB;&#x4F55;&#x8D26;&#x672C;&#x90FD;&#x9700;&#x8981;&#x6709;&#x5E8F;&#x3002;&#x4F60;&#x4E0D;&#x80FD;&#x53D1;&#x8D39;&#x8FD8;&#x6CA1;&#x6709;&#x6536;&#x5230;&#x7684;&#x94B1;&#xFF0C;&#x4E5F;&#x4E0D;&#x80FD;&#x82B1;&#x8D39;&#x5DF2;&#x7ECF;&#x82B1;&#x51FA;&#x53BB;&#x7684;&#x94B1;&#x3002;&#x533A;&#x5757;&#x94FE;&#x4EA4;&#x6613;&#xFF08;&#x6216;&#x8005;&#x8BF4;&#x5305;&#x542B;&#x4EA4;&#x6613;&#x7684;&#x5757;&#xFF09;&#x5FC5;&#x987B;&#x6709;&#x5E8F;&#xFF0C;&#x65E0;&#x6B67;&#x4E49;&#xFF0C;&#x540C;&#x65F6;&#x65E0;&#x9700;&#x53EF;&#x4FE1;&#x7684;&#x7B2C;&#x4E09;&#x65B9;&#x3002;</p>
<p>&#x5373;&#x4FBF;&#x533A;&#x5757;&#x94FE;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x8D26;&#x672C;&#xFF0C;&#x800C;&#x662F;&#x5C31;&#x50CF;&#x65E5;&#x5FD7;&#x4E00;&#x6837;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x5BF9;&#x4E8E;&#x6240;&#x6709;&#x8282;&#x70B9;&#x6765;&#x8BF4;&#xFF0C;&#x5982;&#x679C;&#x8981;&#x60F3;&#x5171;&#x540C;&#x4FDD;&#x6709;&#x4E00;&#x4EFD;&#x5B8C;&#x5168;&#x76F8;&#x540C;&#x7684;&#x533A;&#x5757;&#x94FE;&#x526F;&#x672C;&#xFF0C;&#x6709;&#x5E8F;&#x4E5F;&#x662F;&#x5FC5;&#x4E0D;&#x53EF;&#x5C11;&#x7684;&#x3002;&#x4EA4;&#x6613;&#x987A;&#x5E8F;&#x4E0D;&#x540C;&#xFF0C;&#x5C31;&#x662F;&#x4E0D;&#x540C;&#x7684;&#x4E24;&#x6761;&#x94FE;&#x3002;</p>
<p>&#x4F46;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x4EA4;&#x6613;&#x662F;&#x7531;&#x5168;&#x4E16;&#x754C;&#x7684;&#x533F;&#x540D;&#x53C2;&#x4E0E;&#x8005;&#x751F;&#x6210;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x4E2D;&#x5FC3;&#x5316;&#x673A;&#x6784;&#x8D1F;&#x8D23;&#x7ED9;&#x4EA4;&#x6613;&#x6392;&#x5E8F;&#xFF0C;&#x90A3;&#x53C8;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x8FD9;&#x4E00;&#x70B9;&#x5462;&#xFF1F;&#x6709;&#x4EBA;&#x4F1A;&#x8BF4;&#xFF0C;&#x4EA4;&#x6613;&#xFF08;&#x6216;&#x8005;&#x5757;&#xFF09;&#x53EF;&#x4EE5;&#x5305;&#x542B;&#x65F6;&#x95F4;&#x6233;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x4E9B;&#x65F6;&#x95F4;&#x6233;&#x53C8;&#x5982;&#x4F55;&#x53EF;&#x4FE1;&#x5462;&#xFF1F;</p>
<p>&#x65F6;&#x95F4;&#x662F;&#x4E00;&#x4E2A;<a href="http://www.preposterousuniverse.com/blog/2015/04/03/the-reality-of-time/" target="_blank">&#x4EBA;&#x7C7B;&#x6982;&#x5FF5;</a>&#xFF0C;&#x65F6;&#x95F4;&#x7684;&#x4EFB;&#x4F55;&#x6765;&#x6E90;&#xFF0C;&#x6BD4;&#x5982;&#x4E00;&#x4E2A;&#x539F;&#x5B50;&#x65F6;&#x949F;&#xFF0C;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x201C;&#x53EF;&#x4FE1;&#x7B2C;&#x4E09;&#x65B9;&#x201D;&#xFF0C;&#x9664;&#x6B64;&#x4E4B;&#x5916;&#xFF0C;&#x7531;&#x4E8E;&#x7F51;&#x7EDC;&#x5EF6;&#x8FDF;&#x548C;<a href="http://www.astronomy.ohio-state.edu/~pogge/Ast162/Unit5/gps.html" target="_blank">&#x76F8;&#x5BF9;&#x8BBA;&#x6548;&#x5E94;</a>&#xFF0C;&#x65F6;&#x949F;&#x7684;&#x5927;&#x90E8;&#x5206;&#x65F6;&#x95F4;&#x90FD;&#x6709;&#x8F7B;&#x5FAE;&#x8BEF;&#x5DEE;&#x3002;&#x5F88;&#x9057;&#x61BE;&#xFF0C;&#x5728;&#x4E00;&#x4E2A;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x4E0D;&#x53EF;&#x80FD;&#x901A;&#x8FC7;&#x65F6;&#x95F4;&#x6233;&#x6765;&#x51B3;&#x5B9A;&#x4E8B;&#x4EF6;&#x7684;&#x5148;&#x540E;&#x987A;&#x5E8F;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x6240;&#x5173;&#x5FC3;&#x7684;&#x201C;&#x65F6;&#x95F4;&#x201D;&#x5E76;&#x4E0D;&#x662F;&#x6240;&#x719F;&#x6089;&#x7684;&#x5E74;&#xFF0C;&#x6708;&#xFF0C;&#x65E5;&#x8FD9;&#x79CD;&#x6982;&#x5FF5;&#x3002;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x7684;&#x662F;&#x8FD9;&#x6837;&#x4E00;&#x79CD;&#x673A;&#x5236;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x786E;&#x8BA4;&#x4E00;&#x4E2A;&#x4E8B;&#x4EF6;&#x5728;&#x53E6;&#x4E00;&#x4E2A;&#x4E8B;&#x4EF6;&#x4E4B;&#x524D;&#x53D1;&#x751F;&#xFF0C;&#x6216;&#x8005;&#x53EF;&#x80FD;&#x5E76;&#x53D1;&#x53D1;&#x751F;&#x3002;</p>
<p>&#x9996;&#x5148;&#xFF0C;&#x4E3A;&#x4E86;&#x5EFA;&#x7ACB;&#x4E4B;&#x524D;&#x4E0E;&#x4E4B;&#x540E;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x9996;&#x5148;&#x5FC5;&#x987B;&#x8981;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;<em>&#x65F6;&#x95F4;&#x70B9;</em>&#x7684;&#x6982;&#x5FF5;&#x3002;&#x7406;&#x8BBA;&#x4E0A;&#x6765;&#x8BF4;&#xFF0C;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x70B9;&#x65F6;&#x95F4;&#x7684;&#x6982;&#x5FF5;&#x4F3C;&#x4E4E;&#x5E76;&#x4E0D;&#x592A;&#x53EF;&#x80FD;&#xFF0C;&#x56E0;&#x4E3A;&#x6CA1;&#x6709;&#x6280;&#x672F;&#x80FD;&#x591F;&#x8DB3;&#x591F;&#x7CBE;&#x786E;&#x5730;&#x6D4B;&#x91CF; <a href="https://en.wikipedia.org/wiki/Planck_time" target="_blank">&#x666E;&#x6717;&#x514B;&#x65F6;&#x95F4;</a>&#x3002;&#x4F46;&#x662F;&#x4F60;&#x4F1A;&#x770B;&#x5230;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x901A;&#x8FC7;&#x521B;&#x5EFA;&#x5C5E;&#x4E8E;&#x81EA;&#x5DF1;&#x7684;&#x65F6;&#x95F4;&#x6982;&#x5FF5;&#x53D8;&#x76F8;&#x89E3;&#x51B3;&#x4E86;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x4F7F;&#x5F97;&#x786E;&#x7ACB;&#x7CBE;&#x786E;&#x7684;&#x65F6;&#x95F4;&#x70B9;&#x6982;&#x5FF5;&#x5728;&#x4E8B;&#x5B9E;&#x4E0A;&#x6210;&#x4E3A;&#x53EF;&#x80FD;&#x3002;</p>
<p><a href="https://en.wikipedia.org/wiki/Leslie_Lamport" target="_blank">Leslie Lamport</a> 1978 &#x5E74;&#x7684;&#x8BBA;&#x6587; <a href="https://amturing.acm.org/p558-lamport.pdf" target="_blank">&#x201C;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x65F6;&#x949F;&#x548C;&#x4E8B;&#x4EF6;&#x987A;&#x5E8F;&#x201D;</a> &#x4E2D;&#x5BF9;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x6709;&#x4E86;&#x8BE6;&#x7EC6;&#x63CF;&#x8FF0;&#xFF0C;&#x4F46;&#x662F;&#x9664;&#x4E86;&#x201C;&#x6B63;&#x786E;&#x540C;&#x6B65;&#x7684;&#x7269;&#x7406;&#x65F6;&#x949F;&#x201D;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x5E76;&#x6CA1;&#x6709;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x8BE6;&#x7EC6;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;1982 &#x5E74; Lamport &#x540C;&#x6837;&#x63CF;&#x8FF0;&#x4E86; <a href="https://people.eecs.berkeley.edu/~luca/cs174/byzantine.pdf" target="_blank">&#x201C;&#x62DC;&#x5360;&#x5EAD;&#x5C06;&#x519B;&#x95EE;&#x9898;&#x201D;</a>&#xFF0C;&#x4E2D;&#x672C;&#x806A;&#x5728;&#x4ED6;&#x65E9;&#x671F;&#x7684;&#x4E00;&#x5C01;&#x90AE;&#x4EF6;&#x4E2D; <a href="http://satoshi.nakamotoinstitute.org/emails/cryptography/11/" target="_blank">&#x89E3;&#x91CA;</a> &#x4E86; PoW &#x5982;&#x4F55;&#x89E3;&#x51B3;&#x4E86;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;<a href="https://bitcoin.org/bitcoin.pdf" target="_blank">&#x6BD4;&#x7279;&#x5E01;&#x767D;&#x76AE;&#x4E66;</a> &#x6307;&#x51FA;&#x201C;&#x4E3A;&#x4E86;&#x5728;&#x7AEF;&#x5230;&#x7AEF;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#x5B9E;&#x73B0;&#x4E00;&#x4E2A;&#x5206;&#x5E03;&#x5F0F;&#x7684; <em>&#x65F6;&#x95F4;&#x6233;&#x670D;&#x52A1;&#x5668;</em>&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4F1A;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#x7CFB;&#x7EDF;&#x201D;&#xFF0C;&#x4E5F;&#x8868;&#x660E;&#x4E86;&#x5B83;&#x4E3B;&#x8981;&#x89E3;&#x51B3;&#x4E86;&#x65F6;&#x95F4;&#x6233;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<h2 id="&#x65F6;&#x95F4;&#x662F;&#x6839;&#x672C;&#x95EE;&#x9898;">&#x65F6;&#x95F4;&#x662F;&#x6839;&#x672C;&#x95EE;&#x9898;</h2>
<p>&#x5FC5;&#x987B;&#x8981;&#x5F3A;&#x8C03;&#x7684;&#x662F;&#xFF0C;&#x5728;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;<em>&#x4E0D;&#x53EF;&#x80FD;&#x5C06;&#x4E8B;&#x4EF6;&#x4E0E;&#x65F6;&#x95F4;&#x70B9;&#x5173;&#x8054;&#x8D77;&#x6765;</em>&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x5C1A;&#x4E0D;&#x53EF;&#x89E3;&#x95EE;&#x9898;&#xFF0C;&#x76F4;&#x5230;&#x4E2D;&#x672C;&#x806A;&#x627E;&#x5230;&#x4E86;&#x4E00;&#x4E2A;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x624D;&#x4F7F;&#x5F97;&#x5206;&#x5E03;&#x5F0F;&#x8D26;&#x672C;&#x6210;&#x4E3A;&#x53EF;&#x80FD;&#x3002;&#x5728;&#x533A;&#x5757;&#x94FE;&#x4E2D;&#x8FD8;&#x6709;&#x5F88;&#x591A;&#x5176;&#x4ED6;&#x7684;&#x6280;&#x672F;&#x7EC6;&#x8282;&#xFF0C;&#x4F46;&#x662F;&#x65F6;&#x95F4;&#x662F;&#x6700;&#x57FA;&#x7840;&#x4E5F;&#x662F;&#x6700;&#x91CD;&#x8981;&#x7684;&#x3002;&#x6CA1;&#x6709;&#x65F6;&#x95F4;&#xFF0C;&#x5C31;&#x6CA1;&#x6709;&#x533A;&#x5757;&#x94FE;&#x3002;</p>
<h2 id="pow-&#x56DE;&#x987E;">PoW &#x56DE;&#x987E;</h2>
<p>&#x7B80;&#x800C;&#x8A00;&#x4E4B;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x7684; PoW &#x5C31;&#x662F; <a href="https://en.wikipedia.org/wiki/SHA-2" target="_blank">SHA-2</a> &#x54C8;&#x5E0C;&#x6EE1;&#x8DB3;&#x7279;&#x5B9A;&#x7684;&#x6761;&#x4EF6;&#x7684;&#x4E00;&#x4E2A;&#x89E3;&#xFF0C;&#x8FD9;&#x4E2A;&#x89E3;&#x5F88;&#x96BE;&#x627E;&#x5230;&#x3002;&#x901A;&#x8FC7;&#x8981;&#x6C42;&#x54C8;&#x5E0C;&#x6EE1;&#x8DB3;&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x7684;&#x6570;&#x5B57;&#xFF0C;&#x5C31;&#x786E;&#x5B9A;&#x4E86;&#x4E00;&#x4E2A;&#x96BE;&#x5EA6;&#xFF08;difficulty&#xFF09;&#xFF0C;&#x96BE;&#x5EA6;&#x7684;&#x503C;&#x8D8A;&#x5C0F;&#xFF0C;&#x6EE1;&#x8DB3;&#x8F93;&#x5165;&#x7684;&#x6570;&#x5B57;&#x8D8A;&#x5C11;&#xFF0C;&#x627E;&#x5230;&#x89E3;&#x7684;&#x96BE;&#x5EA6;&#x5C31;&#x8D8A;&#x5927;&#x3002;</p>
<p>&#x8FD9;&#x5C31;&#x662F;&#x6240;&#x8C13;&#x7684;&#x201C;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#x201D;&#xFF0C;&#x56E0;&#x4E3A;&#x6EE1;&#x8DB3;&#x54C8;&#x5E0C;&#x8981;&#x6C42;&#x7684;&#x89E3;&#x975E;&#x5E38;&#x7A00;&#x5C11;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x627E;&#x5230;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x89E3;&#x9700;&#x8981;&#x5F88;&#x591A;&#x8BD5;&#x9519;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#xFF0C;&#x201C;&#x5DE5;&#x4F5C;&#xFF08;work&#xFF09;&#x201D;&#x3002;&#x800C;&#x5DE5;&#x4F5C;&#x4E5F;&#x5C31;&#x662F;&#x610F;&#x5473;&#x7740;<em>&#x65F6;&#x95F4;</em>&#x3002;</p>
<h2 id="&#x5757;&#x95F4;&#x65E0;&#x53D8;&#x5316;">&#x5757;&#x95F4;&#x65E0;&#x53D8;&#x5316;</h2>
<p>&#x94FE;&#x7684;&#x72B6;&#x6001;&#x7531;&#x5757;&#x6240;&#x53CD;&#x6620;&#xFF0C;&#x6BCF;&#x4E2A;&#x65B0;&#x7684;&#x5757;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x72B6;&#x6001;&#x3002;&#x533A;&#x5757;&#x94FE;&#x7684;&#x72B6;&#x6001;&#x6BCF;&#x6B21;&#x5411;&#x524D;&#x63A8;&#x52A8;&#x4E00;&#x4E2A;&#x5757;&#xFF0C;&#x5E73;&#x5747;&#x6BCF;&#x4E2A;&#x5757; 10 &#x5206;&#x949F;&#xFF0C;&#x662F;&#x533A;&#x5757;&#x94FE;&#x91CC;&#x9762;&#x6700;&#x5C0F;&#x7684;&#x65F6;&#x95F4;&#x5EA6;&#x91CF;&#x5355;&#x4F4D;&#x3002;</p>
<h2 id="sha-&#x65E0;&#x8BB0;&#x5FC6;&#xFF0C;&#x65E0;&#x8FDB;&#x5C55;">SHA &#x65E0;&#x8BB0;&#x5FC6;&#xFF0C;&#x65E0;&#x8FDB;&#x5C55;</h2>
<p>SHA(Secure Hash Algorithm) &#x5728;&#x7EDF;&#x8BA1;&#x5B66;&#x548C;&#x6982;&#x7387;&#x4E0A;&#x4EE5;<a href="https://en.wikipedia.org/wiki/Memorylessness" target="_blank">&#x65E0;&#x8BB0;&#x5FC6;&#x6027;&#xFF08;memoryless&#xFF09;</a> &#x95FB;&#x540D;&#x3002;&#x5BF9;&#x4E8E;&#x6211;&#x4EEC;&#x4EBA;&#x7C7B;&#x800C;&#x8A00;&#xFF0C;&#x65E0;&#x8BB0;&#x5FC6;&#x6027;&#x6709;&#x70B9;&#x53CD;&#x76F4;&#x89C9;&#x3002;&#x6240;&#x8C13;&#x65E0;&#x8BB0;&#x5FC6;&#x6027;&#xFF0C;&#x5C31;&#x662F;&#x65E0;&#x8BBA;&#x4E4B;&#x524D;&#x53D1;&#x751F;&#x4E86;&#x4EC0;&#x4E48;&#xFF0C;&#x90FD;&#x4E0D;&#x5F71;&#x54CD;&#x8FD9;&#x4E00;&#x6B21;&#x4E8B;&#x4EF6;&#x53D1;&#x751F;&#x7684;&#x6982;&#x7387;&#x3002;</p>
<p>&#x5173;&#x4E8E;&#x65E0;&#x8BB0;&#x5FC6;&#x6027;&#xFF0C;&#x6700;&#x597D;&#x7684;&#x4F8B;&#x5B50;&#x5C31;&#x662F;&#x629B;&#x786C;&#x5E01;&#x3002;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x786C;&#x5E01;&#x8FDE;&#x7EED; 10 &#x6B21;&#x90FD;&#x662F;&#x6B63;&#x9762;&#xFF0C;&#x90A3;&#x4E48;&#x4E0B;&#x4E00;&#x6B21;&#x662F;&#x53CD;&#x9762;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x4F1A;&#x4E0D;&#x4F1A;&#x66F4;&#x5927;&#x5462;&#xFF1F;&#x6211;&#x4EEC;&#x7684;&#x76F4;&#x89C9;&#x662F;&#x4F1A;&#xFF0C;&#x4F46;&#x662F;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x65E0;&#x8BBA;&#x4E0A;&#x4E00;&#x6B21;&#x7684;&#x7ED3;&#x679C;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x6BCF;&#x6B21;&#x629B;&#x786C;&#x5E01;&#x6B63;&#x53CD;&#x9762;&#x90FD;&#x662F;&#x4E00;&#x534A;&#x4E00;&#x534A;&#x7684;&#x6982;&#x7387;&#x3002;</p>
<p>&#x800C;&#x5BF9;&#x4E8E;&#x9700;&#x8981;&#x65E0;&#x8FDB;&#x5C55;&#xFF08;progress-free&#xFF09;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x65E0;&#x8BB0;&#x5FC6;&#x6027;&#x53C8;&#x662F;&#x5FC5;&#x8981;&#x6761;&#x4EF6;&#x3002;progress-free &#x610F;&#x5473;&#x7740;&#x5F53;&#x77FF;&#x5DE5;&#x8BD5;&#x56FE;&#x901A;&#x8FC7;&#x5BF9; <a href="https://en.bitcoin.it/wiki/Nonce" target="_blank">nonces</a> &#x8FDB;&#x884C;&#x8FED;&#x4EE3;&#x89E3;&#x51B3;&#x96BE;&#x9898;&#x65F6;&#xFF0C;&#x6BCF;&#x4E00;&#x6B21;&#x5C1D;&#x8BD5;&#x90FD;&#x662F;&#x4E00;&#x4E2A;&#x72EC;&#x7ACB;&#x4E8B;&#x4EF6;&#xFF0C;&#x65E0;&#x8BBA;&#x4E4B;&#x524D;&#x5DF2;&#x7ECF;&#x7B97;&#x8FC7;&#x4E86;&#x591A;&#x5C11;&#x6B21;&#xFF0C;&#x6BCF;&#x6B21;&#x5C1D;&#x8BD5;&#x627E;&#x5230;&#x7B54;&#x6848;&#x7684;&#x6982;&#x7387;&#x662F;&#x56FA;&#x5B9A;&#x7684;&#x3002;&#x6362;&#x53E5;&#x8BDD;&#x6765;&#x8BF4;&#xFF0C;&#x6BCF;&#x6B21;&#x5C1D;&#x8BD5;&#xFF0C;&#x53C2;&#x4E0E;&#x8005;&#x90FD;&#x4E0D;&#x4F1A;&#x79BB;&#x201C;&#x7B54;&#x6848;&#x201D;&#x8D8A;&#x8FD1;&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#x6709;&#x4EFB;&#x4F55;&#x8FDB;&#x5C55;&#xFF08;progress&#xFF09;&#x3002;&#x5C31;&#x4E0B;&#x4E00;&#x6B21;&#x5C1D;&#x8BD5;&#x800C;&#x8A00;&#xFF0C;&#x4E00;&#x4E2A;&#x5DF2;&#x7ECF;&#x7B97;&#x4E86;&#x4E00;&#x5E74;&#x7684;&#x77FF;&#x5DE5;&#xFF0C;&#x4E0E;&#x4E0A;&#x4E00;&#x79D2;&#x521A;&#x5F00;&#x59CB;&#x7B97;&#x7684;&#x77FF;&#x5DE5;&#xFF0C;&#x7B97;&#x51FA;&#x6765;&#x7684;&#x6982;&#x7387;&#x662F;&#x4E00;&#x6837;&#x7684;&#x3002;</p>
<p>&#x5728;&#x6307;&#x5B9A;&#x65F6;&#x95F4;&#x5185;&#xFF0C;&#x7ED9;&#x5B9A;&#x4E00;&#x4E2A;&#x96BE;&#x5EA6;&#xFF0C;&#x627E;&#x5230;&#x7B54;&#x6848;&#x7684;&#x6982;&#x7387;<em>&#x552F;&#x4E00;&#x5730;&#x7531;&#x6240;&#x6709;&#x53C2;&#x4E0E;&#x8005;&#x80FD;&#x591F;&#x8FED;&#x4EE3;&#x54C8;&#x5E0C;&#x7684;&#x901F;&#x5EA6;&#x51B3;&#x5B9A;</em>&#x3002;&#x4E0E;&#x4E4B;&#x524D;&#x7684;&#x5386;&#x53F2;&#x65E0;&#x5173;&#xFF0C;&#x4E0E;&#x6570;&#x636E;&#x65E0;&#x5173;&#xFF0C;&#x53EA;&#x8DDF;&#x7B97;&#x529B;&#x6709;&#x5173;&#x3002;</p>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x7B97;&#x529B;&#x662F;&#x4E00;&#x4E2A;&#x4E0E;&#x53C2;&#x4E0E;&#x8005;&#x6570;&#x91CF;&#xFF0C;&#x548C;&#x90A3;&#x4E9B;&#x7528;&#x6765;&#x8BA1;&#x7B97;&#x54C8;&#x5E0C;&#x8BBE;&#x5907;&#x7684;&#x901F;&#x5EA6;&#x76F8;&#x5173;&#x7684;&#x51FD;&#x6570;&#x3002;</p>
<h2 id="sha-&#x4E0E;&#x8F93;&#x5165;&#x65E0;&#x5173;">SHA &#x4E0E;&#x8F93;&#x5165;&#x65E0;&#x5173;</h2>
<p>&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x4E2D;&#xFF0C;&#x8F93;&#x5165;&#x7684;&#x662F;&#x533A;&#x5757;&#x5934;&#x3002;&#x4F46;&#x662F;&#x5982;&#x679C;&#x7ED9;&#x5B83;&#x968F;&#x673A;&#x4F20;&#x5165;&#x4E00;&#x4E9B;&#x503C;&#xFF0C;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x5408;&#x9002;&#x54C8;&#x5E0C;&#x7684;&#x6982;&#x7387;&#x4ECD;&#x7136;&#x662F;&#x4E00;&#x6837;&#x7684;&#x3002;&#x65E0;&#x8BBA;&#x8F93;&#x5165;&#x662F;&#x4E00;&#x4E2A;&#x6709;&#x6548;&#x7684;&#x5757;&#x5934;&#xFF0C;&#x8FD8;&#x662F; /dev/random &#x4E2D;&#x968F;&#x673A;&#x7684;&#x4E00;&#x4E9B;&#x5B57;&#x8282;&#xFF0C;&#x90FD;&#x8981;&#x82B1;&#x8D39;&#x5E73;&#x5747; 10 &#x5206;&#x949F;&#x6765;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x89E3;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x627E;&#x5230;&#x4E86;&#x4E00;&#x4E2A;&#x5408;&#x9002;&#x7684;&#x54C8;&#x5E0C;&#xFF0C;&#x4F46;&#x662F;&#x8F93;&#x5165;&#x5374;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x6709;&#x6548;&#x7684;&#x5757;&#x5934;&#xFF0C;&#x867D;&#x7136;&#x65E0;&#x6CD5;&#x5C06;&#x5757;&#x4E0A;&#x94FE;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x4ECD;&#x7136;&#x662F;&#x4E00;&#x4E2A;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#xFF08;&#x5373;&#x4F7F;&#x6CA1;&#x5565;&#x7528;&#xFF09;&#x3002;</p>
<h2 id="&#x96BE;&#x5EA6;&#x5C5E;&#x4E8E;&#x94F6;&#x6CB3;&#x7CFB;">&#x96BE;&#x5EA6;&#x5C5E;&#x4E8E;&#x94F6;&#x6CB3;&#x7CFB;</h2>
<p>&#x4EE4;&#x4EBA;&#x60CA;&#x5947;&#x7684;&#x662F;&#xFF0C;&#x96BE;&#x5EA6;&#x662F;<em>universe&#xFF08;&#x5168;&#x5B87;&#x5B99;&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#x901A;&#x7528;&#x7684;&#xFF09;</em>&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x5B83;&#x5145;&#x6EE1;&#x4E86;&#x6574;&#x4E2A;&#x5B87;&#x5B99;&#xFF0C;&#x65E0;&#x5904;&#x4E0D;&#x5728;&#x3002;&#x706B;&#x661F;&#x4E0A;&#x7684;&#x77FF;&#x5DE5;&#x4E5F;&#x540C;&#x6837;&#x80FD;&#x53C2;&#x4E0E;&#x6316;&#x77FF;&#xFF0C;&#x4F46;&#x662F;&#x4ED6;&#x4EEC;&#x4E0D;&#x9700;&#x8981;&#x611F;&#x77E5;&#x5230;&#x5730;&#x7403;&#x77FF;&#x5DE5;&#x7684;&#x5B58;&#x5728;&#xFF0C;&#x4E5F;&#x4E0D;&#x9700;&#x8981;&#x4E0E;&#x5730;&#x7403;&#x4E0A;&#x7684;&#x77FF;&#x5DE5;&#x6709;&#x4EA4;&#x6D41;&#xFF0C;&#x4ECD;&#x7136;&#x662F;&#x6BCF; 10 &#x5206;&#x949F;&#x5C31;&#x4F1A;&#x89E3;&#x51B3;&#x4E00;&#x4E2A;&#x201C;&#x96BE;&#x9898;&#x201D;&#x3002;&#xFF08;&#x597D;&#x5427;&#xFF0C;&#x5F53;&#x4ED6;&#x4EEC;&#x89E3;&#x51FA;&#x96BE;&#x9898;&#x65F6;&#xFF0C;&#x9700;&#x8981;&#x544A;&#x8BC9;&#x5730;&#x7403;&#x4E0A;&#x7684;&#x77FF;&#x5DE5;&#xFF0C;&#x5426;&#x5219;&#x6211;&#x4EEC;&#x6C38;&#x8FDC;&#x4E5F;&#x4E0D;&#x77E5;&#x9053;&#xFF09;&#x3002;</p>
<p>&#x4E86;&#x4E0D;&#x8D77;&#x7684;&#x662F;&#xFF0C;&#x8FDC;&#x8DDD;&#x79BB;&#x53C2;&#x4E0E;&#x8005;&#x4E0D;&#x9700;&#x8981;&#x901A;&#x8FC7;&#x771F;&#x6B63;&#x7684;&#x76F8;&#x4E92;&#x4EA4;&#x6D41;&#x8FDB;&#x884C;&#x6C9F;&#x901A;&#xFF0C;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x5728;&#x5171;&#x540C;&#x5730;&#x6C42;&#x89E3;&#x540C;&#x4E00;&#x4E2A;&#x7EDF;&#x8BA1;&#x5B66;&#x95EE;&#x9898;&#xFF0C;&#x5E76;&#x4E14;&#x4ED6;&#x4EEC;&#x751A;&#x81F3;&#x4E92;&#x76F8;&#x611F;&#x77E5;&#x4E0D;&#x5230;&#x5BF9;&#x65B9;&#x7684;&#x5B58;&#x5728;&#x3002;</p>
<p>&#x201C;&#x901A;&#x7528;&#x5C5E;&#x6027;&#xFF08;universal property&#xFF09;&#x201D;&#x4E00;&#x5F00;&#x59CB;&#x770B;&#x8D77;&#x6765;&#x5F88;&#x795E;&#x5947;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x5F88;&#x5BB9;&#x6613;&#x89E3;&#x91CA;&#x3002;&#x6211;&#x7528;&#x4E86;&#x201C;&#x901A;&#x7528;&#x201D;&#x4E00;&#x8BCD;&#xFF0C;&#x56E0;&#x4E3A;&#x5C31;&#x8FD9;&#x4E00;&#x4E2A;&#x8BCD;&#x5373;&#x53EF;&#x8868;&#x8FBE;&#x5230;&#x4F4D;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x5B9E;&#x9645;&#x6307;&#x7684;&#x662F;&#x201C;&#x6240;&#x6709;&#x53C2;&#x4E0E;&#x8005;&#x90FD;&#x77E5;&#x9053;&#xFF08;&#x8FD9;&#x4E2A;&#x96BE;&#x5EA6;&#xFF09;&#x201D;&#x3002;</p>
<p>SHA-256 &#x7684;&#x8F93;&#x5165;&#x53EF;&#x4EE5;&#x662F; 0 &#x5230; 2 &#x7684; 256 &#x65B9;&#x4E4B;&#x95F4;&#x7684;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x6574;&#x6570;&#xFF08;&#x56E0;&#x4E3A;&#x8F93;&#x51FA;&#x662F; 32 &#x5B57;&#x8282;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x5728; 0 &#x5230; 2^256&#xFF0C;&#x4EFB;&#x4F55;&#x8D85;&#x8FC7;&#x8BE5;&#x8303;&#x56F4;&#x7684;&#x6570;&#x5C06;&#x4F1A;&#x5BFC;&#x81F4;&#x51B2;&#x7A81;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x591A;&#x4F59;&#xFF09;&#x3002;&#x5373;&#x4F7F;&#x8FD9;&#x4E2A;&#x96C6;&#x5408;&#x5DF2;&#x7ECF;&#x975E;&#x5E38;&#x5927;&#x4E86;&#xFF08;<a href="https://learncryptography.com/cryptanalysis/why-is-2-256-secure" target="_blank">&#x6BD4;&#x5DF2;&#x77E5;&#x5B87;&#x5B99;&#x91CC;&#x6240;&#x6709;&#x539F;&#x5B50;&#x603B;&#x6570;&#x90FD;&#x5927;</a>&#xFF09;&#xFF0C;&#x4E0D;&#x8FC7;&#x6BCF;&#x4E2A;&#x53C2;&#x4E0E;&#x8005;&#x90FD;&#x77E5;&#x9053;&#x8FD9;&#x4E2A;&#x96C6;&#x5408;&#xFF0C;&#x5E76;&#x4E14;&#x53EA;&#x80FD;&#x4ECE;&#x8FD9;&#x4E2A;&#x96C6;&#x5408;&#x91CC;&#x9009;&#x53D6;&#x4E00;&#x4E2A;&#x6570;&#x3002;</p>
<p>&#x5982;&#x679C;&#x8F93;&#x5165;&#x7684;&#x96C6;&#x5408;&#x5168;&#x4E16;&#x754C;&#x90FD;&#x77E5;&#x9053;&#xFF0C;SHA-256 &#x5168;&#x4E16;&#x754C;&#x90FD;&#x77E5;&#x9053;&#xFF0C;&#x96BE;&#x5EA6;&#x8981;&#x6C42;&#x4E5F;&#x662F;&#x5168;&#x4E16;&#x754C;&#x90FD;&#x77E5;&#x9053;&#x4E86;&#xFF0C;&#x90A3;&#x4E48;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x89E3;&#x7684;&#x6982;&#x7387;&#x81EA;&#x7136;&#x4E5F;&#x5C31;&#x662F;&#x201C;&#x5168;&#x4E16;&#x754C;&#x90FD;&#x77E5;&#x9053;&#xFF08;universe&#xFF09;&#x201D;&#x3002;</p>
<h2 id="&#x8BA1;&#x7B97;-sha-&#x5373;&#x53C2;&#x4E0E;">&#x8BA1;&#x7B97; SHA &#x5373;&#x53C2;&#x4E0E;</h2>
<p>&#x5982;&#x679C;&#x6240;&#x8FF0;&#x95EE;&#x9898;&#x662F;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x5408;&#x9002;&#x7684;&#x54C8;&#x5E0C;&#xFF0C;&#x90A3;&#x4E48;&#x8981;&#x60F3;&#x89E3;&#x51FA;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x53BB;&#x8BD5;&#x4E00;&#x6B21;&#xFF0C;&#x4F46;&#x662F;&#xFF0C;&#x54EA;&#x6015;&#x5C31;&#x8BD5;&#x4E00;&#x6B21;&#xFF0C;&#x4F60;&#x5C31;&#x5DF2;&#x7ECF;&#x5F71;&#x54CD;&#x4E86;&#x6574;&#x4E2A;&#x7B97;&#x529B;&#x3002;&#x5C31;&#x8FD9;&#x6B21;&#x5C1D;&#x8BD5;&#x800C;&#x8A00;&#xFF0C;&#x4F60;&#x5C31;&#x5DF2;&#x7ECF;&#x6210;&#x4E3A;&#x4E86;&#x4E00;&#x4E2A;&#x5E2E;&#x52A9;&#x5176;&#x4ED6;&#x4EBA;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x7684;&#x53C2;&#x4E0E;&#x8005;&#x3002;&#x867D;&#x7136;&#x4F60;&#x4E0D;&#x9700;&#x8981;&#x544A;&#x8BC9;&#x5176;&#x4ED6;&#x4EBA;&#x4F60;&#x201C;&#x505A;&#x4E86;&#x201D;&#xFF08;&#x9664;&#x975E;&#x4F60;&#x627E;&#x5230;&#x4E86;&#x7B54;&#x6848;&#xFF09;&#xFF0C;&#x5176;&#x4ED6;&#x4EBA;&#x4E5F;&#x4E0D;&#x9700;&#x8981;&#x77E5;&#x9053;&#xFF0C;&#x4F46;&#x662F;&#x60F3;&#x8981;&#x627E;&#x5230;&#x89E3;&#x7684;&#x8FD9;&#x6B21;&#x5C1D;&#x8BD5;<em>&#x771F;&#x771F;&#x5207;&#x5207;&#x5730;</em>&#x5F71;&#x54CD;&#x5230;&#x4E86;&#x7ED3;&#x679C;&#x3002;&#x5BF9;&#x4E8E;&#x5168;&#x5B87;&#x5B99;&#x800C;&#x8A00;&#xFF0C;&#x4E5F;&#x662F;&#x5982;&#x6B64;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4E0A;&#x9762;&#x8FD9;&#x6BB5;&#x8BDD;&#x770B;&#x8D77;&#x6765;&#x4ECD;&#x7136;&#x4E0D;&#x662F;&#x90A3;&#x4E48;&#x4EE4;&#x4EBA;&#x4FE1;&#x670D;&#xFF0C;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x7C7B;&#x6BD4;&#x5C31;&#x662F;&#x5BFB;&#x627E;&#x5927;&#x7D20;&#x6570;&#x95EE;&#x9898;&#x3002;&#x627E;&#x5230;&#x6700;&#x5927;&#x7684;&#x7D20;&#x6570;&#x5F88;&#x96BE;&#xFF0C;&#x5E76;&#x4E14;&#x4E00;&#x65E6;&#x627E;&#x5230;&#xFF0C;&#x5B83;&#x5C31;&#x662F;&#x201C;&#x88AB;&#x53D1;&#x73B0;&#x201D;&#x6216;&#x8005;&#x201C;&#x5DF2;&#x77E5;&#x7684;&#x201D;&#x3002;&#x6709;&#x65E0;&#x6570;&#x7684;&#x7D20;&#x6570;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x5168;&#x5B87;&#x5B99;&#x4E2D;&#xFF0C;&#x6BCF;&#x4E2A;&#x6570;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x5B9E;&#x4F8B;&#x3002;&#x56E0;&#x6B64;&#x65E0;&#x8BBA;&#x662F;&#x8C01;&#x8BD5;&#x56FE;&#x627E;&#x5230;&#x6700;&#x5927;&#x7D20;&#x6570;&#xFF0C;&#x5C31;&#x662F;&#x5728;&#x89E3;&#x540C;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x53E6;&#x4E00;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#x5B9E;&#x4F8B;&#x3002;&#x4F60;&#x4E0D;&#x9700;&#x8981;&#x544A;&#x8BC9;&#x5176;&#x4ED6;&#x4EBA;&#x4F60;&#x5DF2;&#x7ECF;&#x6253;&#x7B97;&#x5BFB;&#x627E;&#x6700;&#x5927;&#x7D20;&#x6570;&#xFF0C;&#x4F60;&#x53EA;&#x9700;&#x8981;&#x5728;&#x627E;&#x5230;&#x65F6;&#x901A;&#x77E5;&#x5176;&#x4ED6;&#x4EBA;&#x3002;&#x5982;&#x679C;&#x4ECE;&#x6765;&#x6CA1;&#x6709;&#x4EBA;&#x5BFB;&#x627E;&#x6700;&#x5927;&#x7D20;&#x6570;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x6C38;&#x8FDC;&#x4E5F;&#x4E0D;&#x4F1A;&#x88AB;&#x627E;&#x5230;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x53EA;&#x8981;&#x53C2;&#x4E0E;&#xFF08;&#x4E5F;&#x5C31;&#x662F;&#x8BD5;&#x56FE;&#x627E;&#x5230;&#x7D20;&#x6570;&#xFF09;&#xFF0C;&#x5373;&#x4F7F;&#x5B83;&#x6B63;&#x5728;&#x79D8;&#x5BC6;&#x8FDB;&#x884C;&#xFF0C;&#x4ECD;&#x4F1A;&#x5F71;&#x54CD;&#x7ED3;&#x679C;&#xFF0C;&#x53EA;&#x8981;&#x516C;&#x5E03;&#x6700;&#x540E;&#x7684;&#x53D1;&#x73B0;&#xFF08;&#x5982;&#x679C;&#x627E;&#x5230;&#xFF09;&#x3002;</p>
<p>&#x8FD9;&#x5C31;&#x662F;&#x4E2D;&#x672C;&#x806A;&#x8BBE;&#x8BA1;&#x7684;&#x7CBE;&#x5999;&#x4E4B;&#x5904;&#xFF0C;&#x4ED6;&#x5229;&#x7528;&#x4E86;&#x8FD9;&#x4E2A;&#x4EE4;&#x4EBA;&#x96BE;&#x4EE5;&#x7F6E;&#x4FE1;&#x7684;&#x7EDF;&#x8BA1;&#x5B66;&#x73B0;&#x8C61;&#xFF0C;&#x5373;&#x4EFB;&#x4F55;&#x53C2;&#x4E0E;&#x90FD;&#x4F1A;&#x5F71;&#x54CD;&#x7ED3;&#x679C;&#xFF0C;&#x5373;&#x4F7F;&#x79D8;&#x5BC6;&#x8FDB;&#x884C;&#xFF0C;&#x5373;&#x4F7F;&#x5C1A;&#x672A;&#x6210;&#x529F;&#x3002;</p>
<p>&#x503C;&#x5F97;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x56E0;&#x4E3A; SHA &#x662F; progress-free&#xFF0C;&#x6BCF;&#x4E00;&#x6B21;&#x5C1D;&#x8BD5;&#x90FD;&#x53EF;&#x4EE5;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x4E00;&#x4E2A;&#x53C2;&#x4E0E;&#x8005;&#x52A0;&#x5165;&#x5176;&#x4E2D;&#xFF0C;&#x7136;&#x540E;&#x7ACB;&#x5373;&#x9000;&#x51FA;&#x3002;&#x56E0;&#x6B64;&#x53EF;&#x4EE5;&#x8FD9;&#x4E48;&#x7406;&#x89E3;&#xFF0C;&#x77FF;&#x5DE5;&#x4EEC;&#x6765;&#x4E86;&#x53C8;&#x8D70;&#xFF0C;&#x6BCF;&#x79D2;&#x65E0;&#x6570;&#x6B21;&#x8F6E;&#x56DE;&#x3002;</p>
<h2 id="&#x53C2;&#x4E0E;&#x5EA6;&#x7531;&#x7EDF;&#x8BA1;&#x5B66;&#x63ED;&#x793A;">&#x53C2;&#x4E0E;&#x5EA6;&#x7531;&#x7EDF;&#x8BA1;&#x5B66;&#x63ED;&#x793A;</h2>
<p>&#x8FD9;&#x4E2A;&#x795E;&#x5947;&#x7684;&#x79D8;&#x5BC6;&#x53C2;&#x4E0E;&#xFF08;secret participation&#xFF09;&#x5C5E;&#x6027;&#x53CD;&#x8FC7;&#x6765;&#x4E5F;&#x6210;&#x7ACB;&#x3002;&#x5F88;&#x591A;&#x7F51;&#x7AD9;&#x4E0A;&#x663E;&#x793A;&#x7684;&#x5168;&#x7403;&#x7B97;&#x529B;&#xFF0C;&#x5E76;&#x975E;&#x662F;&#x7531;&#x6BCF;&#x4E2A;&#x77FF;&#x5DE5;&#x5728;&#x67D0;&#x4E2A;&#x201C;&#x77FF;&#x5DE5;&#x6CE8;&#x518C;&#x529E;&#x516C;&#x5BA4;&#x201D;&#x6CE8;&#x518C;&#xFF0C;&#x5E76;&#x5B9A;&#x671F;&#x6C47;&#x62A5;&#x4ED6;&#x4EEC;&#x7684;&#x7B97;&#x529B;&#x800C;&#x6765;&#x3002;&#x5E76;&#x4E0D;&#x5B58;&#x5728;&#x8FD9;&#x79CD;&#x4E8B;&#x60C5;&#x3002;</p>
<p>&#x56E0;&#x4E3A;&#x5BF9;&#x4E8E;&#x5728; 10 &#x5206;&#x949F;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x6307;&#x5B9A;&#x96BE;&#x5EA6;&#x7684;&#x89E3;&#xFF0C;&#x6240;&#x9700;&#x7B97;&#x529B;&#x662F;&#x5DF2;&#x77E5;&#x7684;&#xFF0C;&#x4E00;&#x4E2A;&#x4EBA;&#x5E73;&#x5747;&#x5FC5;&#x987B;&#x5C1D;&#x8BD5;&#x8FD9;&#x4E48;&#x591A;&#x6B21;&#xFF08;&#x622A;&#x6B62;&#x6210;&#x6587;&#x4E4B;&#x65F6;&#x5927;&#x6982; 10^21&#xFF09;&#x624D;&#x80FD;&#x627E;&#x5230;&#x7B54;&#x6848;&#xFF0C;&#x65E0;&#x8BBA;&#x8FD9;&#x4E2A;&#x4EBA;&#x662F;&#x8C01;&#xFF0C;&#x4ED6;&#x5728;&#x54EA;&#x513F;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x4E0D;&#x77E5;&#x9053;&#x8FD9;&#x4E9B;&#x53C2;&#x4E0E;&#x8005;&#x662F;&#x8C01;&#xFF0C;&#x4ED6;&#x4EEC;&#x4E5F;&#x4ECE;&#x6765;&#x90FD;&#x4E0D;&#x4F1A;&#x8BF4;&#x6211;&#x6B63;&#x5728;&#x53C2;&#x4E0E;&#x5176;&#x4E2D;&#xFF0C;&#x6CA1;&#x6709;&#x627E;&#x5230;&#x89E3;&#x7684;&#x4EBA;&#xFF08;&#x5B9E;&#x9645;&#x4E0A;&#x4ED6;&#x4EEC;&#x90FD;&#x662F;&#xFF09;&#x4ECE;&#x6765;&#x4E0D;&#x4F1A;&#x544A;&#x8BC9;&#x5176;&#x4ED6;&#x4EBA;&#x4ED6;&#x4EEC;&#x6B63;&#x5728;&#x8FDB;&#x884C;&#x8BA1;&#x7B97;&#xFF0C;&#x4ED6;&#x4EEC;&#x53EF;&#x80FD;&#x5728;&#x4E16;&#x754C;&#x4E0A;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x5730;&#x65B9;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x80AF;&#x5B9A;&#x4ED6;&#x4EEC;&#x5FC5;&#x7136;&#x5B58;&#x5728;&#x3002;&#x56E0;&#x4E3A;&#x751F;&#x6D3B;&#x8FD8;&#x8981;&#x7EE7;&#x7EED;&#xFF0C;&#x95EE;&#x9898;&#xFF08;&#x627E;&#x5230;&#x6EE1;&#x8DB3;&#x6761;&#x4EF6;&#x7684;&#x54C8;&#x5E0C;&#xFF09;&#x59CB;&#x7EC8;&#x8FD8;&#x662F;&#x8981;&#x88AB;&#x89E3;&#x51B3;&#x3002;</p>
<h2 id="&#x5DE5;&#x4F5C;&#xFF08;work&#xFF09;&#x662F;&#x4E00;&#x4E2A;&#x65F6;&#x949F;&#xFF08;clock&#xFF09;">&#x5DE5;&#x4F5C;&#xFF08;work&#xFF09;&#x662F;&#x4E00;&#x4E2A;&#x65F6;&#x949F;&#xFF08;clock&#xFF09;</h2>
<p>&#x5173;&#x952E;&#x4E4B;&#x5904;&#x5728;&#x4E8E;&#xFF1A;&#x627E;&#x5230;&#x6EE1;&#x8DB3;&#x6761;&#x4EF6;&#x7684;&#x54C8;&#x5E0C;&#x7684;&#x96BE;&#x5EA6;&#xFF0C;&#x5C31;&#x7C7B;&#x4F3C;&#x4E8E;&#x4E00;&#x4E2A;&#x65F6;&#x949F;&#x7684;&#x89D2;&#x8272;&#x3002;&#x4E00;&#x4E2A;&#x5B87;&#x5B99;&#xFF08;universe&#xFF09;&#x65F6;&#x949F;&#xFF0C;&#x56E0;&#x4E3A;&#x5168;&#x5B87;&#x5B99;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x8FD9;&#x6837;&#x7684;&#x65F6;&#x949F;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x540C;&#x6B65;&#xFF0C;&#x4EFB;&#x4F55;&#x4EBA;&#x90FD;&#x80FD;&#x201C;&#x770B;&#x201D;&#x5230;&#x8FD9;&#x4E2A;&#x65F6;&#x949F;&#x3002;</p>
<p>&#x5373;&#x4F7F;&#x8FD9;&#x4E2A;&#x65F6;&#x949F;&#x4E0D;&#x7CBE;&#x786E;&#x4E5F;&#x6CA1;&#x5173;&#x7CFB;&#x3002;&#x91CD;&#x8981;&#x7684;&#x662F;&#xFF0C;&#x5BF9;&#x6240;&#x6709;&#x4EBA;&#x6765;&#x8BF4;&#xFF0C;&#x5B83;&#x90FD;&#x662F;&#x540C;&#x4E00;&#x4E2A;&#x65F6;&#x949F;&#xFF0C;&#x94FE;&#x7684;&#x72B6;&#x6001;&#x4E0E;&#x8FD9;&#x4E2A;&#x65F6;&#x949F;&#x7684;&#x6EF4;&#x7B54;&#xFF08;tick&#xFF09;&#x65E0;&#x6B67;&#x4E49;&#x5730;&#x7ED1;&#x5B9A;&#x5230;&#x4E00;&#x8D77;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x65F6;&#x949F;&#x7531;&#x904D;&#x5E03;&#x5730;&#x7403;&#x4E0A;&#x7684;&#x672A;&#x77E5;&#x6570;&#x91CF;&#x7684;&#x53C2;&#x4E0E;&#x8005;&#x5171;&#x540C;&#x64CD;&#x4F5C;&#xFF0C;&#x53C2;&#x4E0E;&#x8005;&#x76F8;&#x4E92;&#x4E4B;&#x95F4;&#x5B8C;&#x5168;&#x72EC;&#x7ACB;&#x3002;</p>
<h2 id="&#x8C1C;&#x9898;&#x7684;&#x6700;&#x540E;&#x4E00;&#x90E8;&#x5206;">&#x8C1C;&#x9898;&#x7684;&#x6700;&#x540E;&#x4E00;&#x90E8;&#x5206;</h2>
<p>&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x5FC5;&#x987B;&#x662F;&#x5757;&#x54C8;&#x5E0C;&#xFF08;&#x51C6;&#x786E;&#x6765;&#x8BF4;&#xFF0C;&#x662F;&#x5757;&#x5934;&#xFF09;&#x3002;&#x4E0A;&#x9762;&#x5DF2;&#x7ECF;&#x63D0;&#x5230;&#xFF0C;&#x5BF9;&#x4E8E; SHA &#x6765;&#x8BF4;&#xFF0C;&#x8F93;&#x5165;&#x7684;&#x5185;&#x5BB9;&#x5E76;&#x4E0D;&#x91CD;&#x8981;&#xFF0C;&#x4F46;&#x662F;&#x5982;&#x679C;&#x5B83;&#x662F;&#x771F;&#x5B9E;&#x7684;&#x5757;&#xFF0C;&#x90A3;&#x4E48;&#x65E0;&#x8BBA;&#x4F55;&#x65F6;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x89E3;&#xFF0C;&#x5B83;&#x90FD;&#x53D1;&#x751F;&#x5728; PoW &#x8FD9;&#x4E2A;&#x65F6;&#x949F;&#x7684;&#x6EF4;&#x7B54;&#x5904;&#x3002;&#x6CA1;&#x6709;&#x65E9;&#x4E00;&#x70B9;&#xFF0C;&#x6CA1;&#x6709;&#x665A;&#x4E00;&#x70B9;&#xFF0C;&#x800C;&#x662F;&#x6070;&#x597D;&#x5728;&#x8FD9;&#x4E2A;&#x70B9;&#x3002;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x8FD9;&#x662F;&#x6BEB;&#x65E0;&#x6B67;&#x4E49;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5757;&#x662F;&#x6574;&#x4E2A;&#x673A;&#x5236;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002;</p>
<p>&#x6362;&#x53E5;&#x8BDD;&#x6765;&#x8BF4;&#xFF0C;&#x5982;&#x679C;&#x5757;&#x4E0D;&#x662F; SHA256 &#x51FD;&#x6570;&#x7684;&#x8F93;&#x5165;&#xFF0C;&#x6211;&#x4EEC;&#x4ECD;&#x7136;&#x6709;&#x4E00;&#x4E2A;&#x5206;&#x5E03;&#x5F0F;&#x65F6;&#x949F;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x65E0;&#x6CD5;&#x5C06;&#x5757;&#x7ED1;&#x5B9A;&#x5230;&#x8FD9;&#x4E2A;&#x65F6;&#x949F;&#x7684;&#x6EF4;&#x7B54;&#x4E0A;&#x3002;&#x5C06;&#x5757;&#x4F5C;&#x4E3A;&#x8F93;&#x5165;&#x5C31;&#x89E3;&#x51B3;&#x4E86;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x503C;&#x5F97;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x7684; PoW &#x65F6;&#x949F;&#x53EA;&#x63D0;&#x4F9B;&#x4E86;&#x6EF4;&#x7B54;&#x3002;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x6CA1;&#x529E;&#x6CD5;&#x4ECE;&#x6EF4;&#x7B54;&#x4E2D;&#x5206;&#x51FA;&#x987A;&#x5E8F;&#xFF0C;&#x4E8E;&#x662F;&#x5C31;&#x5F15;&#x5165;&#x4E86;&#x54C8;&#x5E0C;&#x94FE;&#xFF08;hash chain&#xFF09;&#x3002;</p>
<h2 id="&#x5206;&#x5E03;&#x5F0F;&#x5171;&#x8BC6;">&#x5206;&#x5E03;&#x5F0F;&#x5171;&#x8BC6;</h2>
<p>&#x5171;&#x8BC6;&#xFF08;consensus&#xFF09;&#x610F;&#x5473;&#x7740;&#x610F;&#x89C1;&#x4E00;&#x81F4;&#xFF08;agreement&#xFF09;&#x3002;&#x6240;&#x6709;&#x53C2;&#x4E0E;&#x8005;&#x522B;&#x65E0;&#x9009;&#x62E9;&#xFF0C;&#x53EA;&#x80FD;&#x540C;&#x610F;&#x201C;&#x65F6;&#x949F;&#x5DF2;&#x7136;&#x6EF4;&#x7B54;&#x201D;&#x3002;&#x5E76;&#x4E14;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x77E5;&#x9053;&#x6EF4;&#x7B54;&#x548C;&#x9644;&#x52A0;&#x7684;&#x6570;&#x636E;&#x3002;&#x6B63;&#x5982;&#x4E2D;&#x672C;&#x806A;&#x5728;&#x90AE;&#x4EF6;&#x91CC;&#x9762;&#x6240;&#x89E3;&#x91CA;&#x7684;&#xFF0C;&#x8FD9;&#x786E;&#x5B9E;&#x89E3;&#x51B3;&#x4E86;&#x62DC;&#x5360;&#x5EAD;&#x5C06;&#x519B;&#x95EE;&#x9898;&#xFF0C;&#x3002;</p>
<p>&#x5728;&#x4E00;&#x4E2A;&#x7F55;&#x89C1;&#x5374;&#x53C8;&#x5E38;&#x89C1;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4F1A;&#x51FA;&#x73B0;&#x5171;&#x8BC6;&#x5206;&#x79BB;&#xFF0C;&#x6709;&#x4E24;&#x4E2A;&#x8FDE;&#x7EED;&#x7684;&#x6EF4;&#x7B54;&#x4E0E;&#x4E00;&#x4E2A;&#x5757;&#x6709;&#x5173;&#x8054;&#xFF0C;&#x8FD9;&#x5C31;&#x53D1;&#x751F;&#x4E86;&#x51B2;&#x7A81;&#x3002;&#x901A;&#x8FC7;&#x54EA;&#x4E2A;&#x5757;&#x4E0E;&#x4E0B;&#x4E00;&#x4E2A;&#x6EF4;&#x7B54;&#x76F8;&#x5173;&#x8054;&#x89E3;&#x51B3;&#x4E86;&#x8FD9;&#x4E2A;&#x51B2;&#x7A81;&#xFF0C;&#x540C;&#x65F6;&#x5C06;&#x6709;&#x4E89;&#x8BAE;&#x7684;&#x5757;&#x53D8;&#x4E3A;&#x201C;&#x5B64;&#x513F;&#x5757;&#xFF08;orphan&#xFF09;&#x201D;&#x3002;&#x94FE;&#x5982;&#x4F55;&#x7EE7;&#x7EED;&#x662F;&#x4E2A;&#x6982;&#x7387;&#x95EE;&#x9898;&#xFF08;a matter of chance&#xFF09;&#xFF0C;&#x8FD9;&#x4E5F;&#x53EF;&#x80FD;&#x95F4;&#x63A5;&#x5730;&#x5F52;&#x56E0;&#x4E8E; PoW &#x7684;&#x65F6;&#x949F;&#x3002;</p>
<h2 id="&#x5C31;&#x8FD9;&#x6837;">&#x5C31;&#x8FD9;&#x6837;</h2>
<p>&#x8FD9;&#x5C31;&#x662F;&#x533A;&#x5757;&#x94FE;&#x7684; PoW&#xFF08;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#xFF09;&#x3002;&#x5B83;&#x5E76;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x4E3A;&#x4E86;&#x8BA9;&#x77FF;&#x5DE5;&#x8D62;&#x5F97;&#x51FA;&#x5757;&#x6743;&#x7684;&#x201C;&#x4E50;&#x900F;&#x201D;&#xFF0C;&#x4E5F;&#x4E0D;&#x662F;&#x4E3A;&#x4E86;&#x5C06;&#x5B9E;&#x9645;&#x80FD;&#x6E90;&#x8F6C;&#x6362;&#x6210;&#x4E00;&#x4E2A;&#x6709;&#x4EF7;&#x503C;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x8FD9;&#x4E9B;&#x90FD;&#x504F;&#x79BB;&#x4E86;&#x672C;&#x8D28;&#x3002;</p>
<p>&#x6BD4;&#x5982;&#x77FF;&#x5DE5;&#x5956;&#x52B1;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x867D;&#x7136;&#x8FD9;&#x4E9B;&#x5956;&#x52B1;&#x6FC0;&#x52B1;&#x4E86;&#x77FF;&#x5DE5;&#x53C2;&#x4E0E;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x5E76;&#x4E0D;&#x662F;&#x533A;&#x5757;&#x94FE;&#x8BDE;&#x751F;&#x7684;&#x5FC5;&#x8981;&#x56E0;&#x7D20;&#x3002;&#x5757;&#x54C8;&#x5E0C;&#x5F62;&#x6210;&#x4E00;&#x6761;&#x94FE;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x4E0E;&#x5DE5;&#x4F5C;&#x91CF;&#x5E76;&#x6CA1;&#x4EC0;&#x4E48;&#x5173;&#x7CFB;&#xFF0C;&#x5B83;&#x662F;&#x4ECE;&#x5BC6;&#x7801;&#x5B66;&#x4E0A;&#x5F3A;&#x5236;&#x4FDD;&#x8BC1;&#x4E86;&#x5757;&#x7684;&#x987A;&#x5E8F;&#x3002;&#x54C8;&#x5E0C;&#x94FE;&#x4F7F;&#x5F97;&#x524D;&#x4E00;&#x4E2A;&#x6EF4;&#x7B54;&#x201C;&#x66F4;&#x786E;&#x5B9A;&#x201D;&#xFF0C;&#x201C;&#x66F4;&#x52A0;&#x4E0D;&#x53EF;&#x62B5;&#x8D56;&#x201D;&#xFF0C;&#x6216;&#x8005;&#x7B80;&#x5355;&#x6765;&#x8BF4;&#xFF0C;&#x66F4;&#x5B89;&#x5168;&#x3002;</p>
<p>PoW &#x4E5F;&#x80FD;&#x4F7F;&#x5757;&#x4E0D;&#x53EF;&#x66F4;&#x6539;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x597D;&#x7684;&#x526F;&#x4F5C;&#x7528;&#xFF0C;&#x4E5F;&#x4F7F;&#x5F97;&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#xFF08;Segregated Witness&#xFF09;&#x6210;&#x4E3A;&#x53EF;&#x80FD;&#xFF0C;&#x4F46;&#x662F;&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x4E5F;&#x80FD;&#x901A;&#x8FC7;&#x4FDD;&#x7559;&#x7B7E;&#x540D;&#xFF08;&#x89C1;&#x8BC1;,witness&#xFF09;&#x5B9E;&#x73B0;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x4E5F;&#x662F;&#x6B21;&#x8981;&#x7684;&#x3002;</p>
<h2 id="&#x7ED3;&#x8BBA;">&#x7ED3;&#x8BBA;</h2>
<p>&#x6BD4;&#x7279;&#x88AB;&#x7684; PoW &#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x5206;&#x5E03;&#x5F0F;&#xFF0C;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x7684;&#x65F6;&#x949F;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x7406;&#x89E3;&#x4E86;&#x8FD9;&#x4E2A;&#x89E3;&#x91CA;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x5E94;&#x8BE5;&#x80FD;&#x591F;&#x66F4;&#x597D;&#x5730;&#x7406;&#x89E3; PoW &#x4E0E; PoS &#x7684;&#x5F02;&#x540C;&#x3002;&#x663E;&#x7136;&#xFF0C;&#x4E24;&#x8005;&#x4E0D;&#x5177;&#x6709;&#x53EF;&#x6BD4;&#x6027;&#xFF1A;PoS &#x662F;&#x6709;&#x5173;&#x4E8E;&#xFF08;&#x968F;&#x673A;&#x5206;&#x5E03;&#x7684;&#xFF09;&#x6743;&#x529B;&#xFF08;authority&#xFF09;&#xFF0C;&#x800C; PoW &#x662F;&#x4E00;&#x4E2A;&#x65F6;&#x949F;&#x3002;</p>
<p>&#x5728;&#x533A;&#x5757;&#x94FE;&#x7684;&#x80CC;&#x666F;&#x4E0B;&#xFF0C;PoW &#x8FD9;&#x4E2A;&#x540D;&#x5B57;&#x53EF;&#x80FD;&#x662F;&#x4E2A;&#x8BEF;&#x7528;&#xFF0C;&#x8D77;&#x7684;&#x5E76;&#x4E0D;&#x592A;&#x597D;&#x3002;&#x8FD9;&#x4E2A;&#x8BCD;&#x6765;&#x6E90;&#x4E8E; <a href="https://en.wikipedia.org/wiki/Hashcash" target="_blank">Hashcash</a> &#x9879;&#x76EE;&#xFF0C;&#x5B83;&#x786E;&#x5B9E;&#x7528;&#x4E8E;&#x8BC1;&#x5B9E;&#x5DE5;&#x4F5C;&#xFF08;work&#xFF09;&#x3002;&#x5728;&#x533A;&#x5757;&#x94FE;&#x4E2D;&#xFF0C;&#x5B83;&#x4E3B;&#x8981;&#x5173;&#x4E8E;&#x53EF;&#x9A8C;&#x8BC1;&#x7684;&#x82B1;&#x8D39;&#x65F6;&#x95F4;&#x3002;&#x5F53;&#x4E00;&#x4E2A;&#x4EBA;&#x53D1;&#x73B0;&#x6EE1;&#x8DB3;&#x96BE;&#x5EA6;&#x7684;&#x54C8;&#x5E0C;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x5B83;&#x5FC5;&#x7136;&#x4F1A;&#x82B1;&#x8D39;&#x4E00;&#x4E9B;&#x65F6;&#x95F4;&#x3002;&#x5B9E;&#x73B0;&#x65F6;&#x95F4;&#x5EF6;&#x8FDF;&#x7684;&#x65B9;&#x6CD5;&#x5C31;&#x662F;&#x201C;&#x5DE5;&#x4F5C;&#x201D;&#xFF0C;&#x800C;&#x54C8;&#x5E0C;&#x5C31;&#x662F;&#x8FD9;&#x6BB5;&#x65F6;&#x95F4;&#x7684;&#x8BC1;&#x660E;&#x3002;</p>
<p>PoW &#x662F;&#x5173;&#x4E8E; time &#x800C;&#x975E; work &#x7684;&#x4E8B;&#x5B9E;&#x4E5F;&#x8868;&#x660E;&#xFF0C;&#x53EF;&#x80FD;&#x5B58;&#x5728;&#x4E00;&#x4E9B;&#x5176;&#x4ED6;&#x7684;&#x7EDF;&#x8BA1;&#x5B66;&#x95EE;&#x9898;&#xFF0C;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x540C;&#x6837;&#x6D88;&#x8017;&#x65F6;&#x95F4;&#xFF0C;&#x4F46;&#x5374;&#x9700;&#x8981;&#x66F4;&#x5C11;&#x7684;&#x80FD;&#x6E90;&#x3002;&#x8FD9;&#x4E5F;&#x53EF;&#x80FD;&#x610F;&#x5473;&#x7740;&#x6BD4;&#x7279;&#x5E01;&#x7B97;&#x529B;&#x6709;&#x4E9B;&#x201C;&#x8FC7;&#x5206;&#x201D;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x5728;&#x4E0A;&#x9762;&#x6240;&#x63CF;&#x8FF0;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x65F6;&#x949F;&#xFF0C;&#x5728;&#x53EA;&#x6709;&#x90E8;&#x5206;&#x7B97;&#x529B;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4E5F;&#x662F;&#x53EF;&#x4FE1;&#x7684;&#xFF0C;&#x8FD9;&#x662F;&#x8FD9;&#x79CD;&#x6FC0;&#x52B1;&#x7ED3;&#x6784;&#x63A8;&#x52A8;&#x4E86;&#x80FD;&#x6E90;&#x6D88;&#x8017;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x627E;&#x5230;&#x4E86;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#x80FD;&#x591F;&#x540C;&#x6B65;&#x6EF4;&#x7B54;&#xFF0C;&#x5E76;&#x4E14;&#x9700;&#x8981;&#x66F4;&#x5C11;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x4EF7;&#x503C;&#x4E07;&#x4EBF;&#x7F8E;&#x5143;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x8BF7;&#x4E00;&#x5B9A;&#x8981;&#x544A;&#x8BC9;&#x6211;&#xFF01;</p>
<p>P.S.  &#x7279;&#x522B;&#x611F;&#x8C22; <a href="https://galton.uchicago.edu/" target="_blank">UChicago Statistics</a> &#x7684; <a href="http://sashat.me/" target="_blank">Sasha Trubetskoy</a> &#x5BF9;&#x4E0A;&#x8FF0;&#x6587;&#x5B57;&#x7684; review &#x548C;&#x5EFA;&#x8BAE;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="../misc/the-blockchain-economy-a-beginners-guide-to-institutional-cryptoeconomics.html" class="navigation navigation-prev " aria-label="Previous page: 区块链经济学：制度加密经济学入门指南">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="../misc/dpos-consensus-algorithm-this-missing-white-paper.html" class="navigation navigation-next " aria-label="Next page: DPOS 共识算法 - 缺失的白皮书">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"PoW 本质上是个去中心化的时钟","level":"7.3","depth":1,"next":{"title":"DPOS 共识算法 - 缺失的白皮书","level":"7.4","depth":1,"path":"misc/dpos-consensus-algorithm-this-missing-white-paper.md","ref":"misc/dpos-consensus-algorithm-this-missing-white-paper.md","articles":[]},"previous":{"title":"区块链经济学：制度加密经济学入门指南","level":"7.2","depth":1,"path":"misc/the-blockchain-economy-a-beginners-guide-to-institutional-cryptoeconomics.md","ref":"misc/the-blockchain-economy-a-beginners-guide-to-institutional-cryptoeconomics.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"fundamentals/explain-pow.md","mtime":"2018-08-17T11:16:46.000Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-08-21T04:33:47.527Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

